{
  "3 weeks": {
    "Pregnancy symptoms at 3 weeks": "You may feel pregnant, but it's unlikely you'll get a clear result from a pregnancy test at this stage. A sensitive test may show a faint line. But this can just leave you feeling confused, rather than satisfied or excited.\n\nThe clearest sign that you're pregnant is a missed period. Yours probably isn't due until the end of this week or even next week, depending on the length of your menstrual cycle.\n\nIn the meantime, your sense of smell may change, so it's possible that smells you usually like, or are indifferent to, suddenly don't appeal to you anymore. Due to changing levels of oestrogen, you may also experience a metallic taste in your mouth.\n\nPregnancy hormones may also be having an effect on you, making you feel tired and weepy. During the day, you may feel exhausted and struggle to stay awake. This is because your body is preparing itself to support your baby.",
    "link": "https://assets.babycenter.com/ims/2024/08/03-body-E-deeptan-4x3.png",
    "your pregnancy diet at 3 weeks": "You may get food cravings or notice that you no longer want any of your favourite foods and drinks. Aversions to tea, coffee, alcohol, fried food and eggs are common among new mums-to-be. This can work to your advantage, as you should not be drinking any alcohol at all during your pregnancy. You'll also need to limit your caffeine intake to no more than 200mg a day. This means you can still enjoy your daily tea or coffee, but keep a tab on how much you're having. Caffeine is also found in green tea, chocolate and many cold drinks.\n\nHave plenty of fruit, vegetables and sources of protein in your diet. That will set you off to a healthy start of your pregnancy. To know more, see our guide to a diet for a healthy mum-to-be.",
    "BabyCenter mum tip of the week": "\"I did an early test that showed a faint line, and I didn't know what to think. Waiting a few more days before testing would have saved me a lot of uncertainty!\"\n-Miriam"
  },
  "4 weeks": {
    "Pregnancy symptoms at 4 weeks": "This is the week you may discover you're pregnant! Your period is due around the end of this week, and if it doesn't arrive, you may decide to do a pregnancy test.\n\nYou may notice that your breasts are tender and swollen, and the areolas (the darker skin around your nipples) may already be darkening. You may also feel a bit bloated, and find that your clothes feel tighter around your waist and breasts.\n\nSome women experience a small amount of spotting around the time their period would have been due. This is known as implantation bleeding, and it happens when the fertilised egg attaches to the lining of your womb. It's perfectly normal, but if you're concerned, or the bleeding becomes heavy, see your doctor.",
    "link": "https://assets.babycenter.com/ims/2024/08/04-body-E-deeptan-4x3.png",
    "your pregnancy diet at 4 weeks": "You're probably just finding out you're pregnant, so now's the time to start eating well. Make sure you're getting plenty of folic acid, which helps to prevent neural tube defects such as spina bifida. Good sources include green leafy vegetables, fortified cereals, and bread.\n\nYou should also take a daily folic acid supplement of 400 micrograms, from now until you're 12 weeks pregnant. If you haven't already started taking folic acid, don't worry, just start as soon as you can.\n\nIf you're feeling nauseous, try eating little and often, and stick to bland, starchy foods such as crackers or toast. Keep a snack by your bed to eat before you get up, as this can help with morning sickness.",
    "BabyCenter mum tip of the week": "\"I started taking a prenatal vitamin as soon as I found out I was pregnant. It made me feel like I was doing something positive for my baby right from the start.\"\n-Jasmine"
  },
  "5 weeks": {
    "Pregnancy symptoms at 5 weeks": "You may be starting to feel some early pregnancy symptoms, such as nausea, fatigue, or frequent urination. Morning sickness can strike at any time of day, and despite its name, it's not just confined to the morning! Some women start to feel sick as early as this week, while others may not experience it at all.\n\nYour breasts may be feeling increasingly tender and swollen. You may also notice that your sense of smell has become more sensitive, and certain odors might trigger nausea.\n\nYou might be feeling more tired than usual as your body works hard to support your growing baby. Try to rest when you can, and don't push yourself too hard.",
    "link": "https://assets.babycenter.com/ims/2024/08/05-body-E-deeptan-4x3.png",
    "your pregnancy diet at 5 weeks": "Eating well can be challenging if you're experiencing morning sickness. Try to eat small, frequent meals throughout the day to keep your blood sugar levels stable, which can help reduce nausea.\n\nStay hydrated by drinking plenty of water, and consider ginger tea or lemon water if you're feeling sick. Bland foods like crackers, toast, and rice can be easier to tolerate.\n\nContinue taking your folic acid supplement, and try to include iron-rich foods in your diet, such as lean red meat, beans, and fortified cereals. Iron is important for preventing anemia, which is common during pregnancy.",
    "BabyCenter mum tip of the week": "\"When morning sickness hit, I found that keeping crackers by my bed helped. I'd eat a few before getting up, and it really took the edge off the nausea.\"\n-Sophia"
  },
  "6 weeks": {
    "Pregnancy symptoms at 6 weeks": "Morning sickness may be in full swing by now. You may be feeling nauseous and possibly vomiting. Remember that morning sickness can happen at any time of day, not just in the morning.\n\nYou may be experiencing food cravings or aversions. Some women suddenly can't stand the smell or taste of certain foods, while others crave foods they don't normally eat.\n\nYou may be feeling extremely tired as your body works hard to support your growing baby. Your breasts may continue to feel tender and swollen, and you may need to urinate more frequently than usual.",
    "link": "https://assets.babycenter.com/ims/2024/08/06-body-E-deeptan-4x3.png",
    "your pregnancy diet at 6 weeks": "If you're struggling with morning sickness, focus on eating what you can tolerate. Don't worry too much about having a perfectly balanced diet right now - just try to stay hydrated and eat when you can.\n\nSome women find that eating little and often helps with nausea. Try to have a small snack every two to three hours, even if you don't feel hungry.\n\nIf you're craving certain foods, it's usually fine to indulge, as long as they're not harmful to your baby (such as unpasteurized cheese, raw meat, or alcohol). Just try to keep everything in moderation.",
    "BabyCenter mum tip of the week": "\"I found that sea-bands (acupressure wristbands) really helped with my morning sickness. They're cheap, drug-free, and you can wear them all day.\"\n-Emma"
  }
}
