[
    {
      "id": 1,
      "title": "Crispy Quinoa & Roasted Vegetable Kale Salad",
      "image": "https://minimalistbaker.com/wp-content/uploads/2022/10/Kale-Salad-with-Crispy-Quinoa-6.jpg",
      "calories": 465,
      "prepTime": "30mins",
      "servings": 2,
      "category": [],
      "ingredients": [
        "2 large carrots, peeled and sliced into 1/4-inch rounds",
        "1 medium red bell pepper, sliced into uniform bite-size pieces",
        "½ cup of sliced red onion (1/4-inch wide half circles)",
        "½ cup of diced beet (or substitute with sweet potato or more carrot)",
        "Avocado or olive oil (enough to coat veggies well) to taste",
        "2 tsp of dried Italian herb seasoning",
        "1 tsp of red pepper flakes (optional)",
        "1 tsp of garlic powder",
        "¼ tsp of sea salt",
        "¼ tsp of black pepper",
        "1 cup of cooked, cooled quinoa (or substitute with another grain of choice)",
        "1½ cups of sliced shiitake mushrooms",
        "Avocado or olive oil to taste",
        "2 tbsp of coconut aminos",
        "7 cups of chopped kale (curly or dino)",
        "3 tbsp of balsamic vinegar",
        "½ tbsp of olive oil",
        "2 tbsp of tahini",
        "⅛ tsp of sea salt",
        "⅛ tsp of black pepper",
        "A dash of garlic powder",
        "½ ripe avocado, diced (optional)",
        "¼ cup of slivered toasted almonds (or other nut/seed of choice)",
        "1 tbsp of hemp seeds",
        "Vegan parmesan cheese to taste"
    ],
      "instructions": [
        "step1: If you haven't already prepared your quinoa (or grain of choice), do so now on the stovetop or in the Instant Pot. Let cool, then proceed to step 2.",
        "step2: Preheat your oven to 375°F (190°C) and line two small baking sheets with parchment paper.",
        "step3: On one baking sheet, add the chopped carrots, bell pepper, onion, and beet. Toss the vegetables with 2 tablespoons of oil, Italian herbs, red pepper flakes (if using), garlic powder, salt, and pepper.",
        "step4: On the second baking sheet, add the cooked, cooled quinoa and sliced shiitake mushrooms. Toss with 1-2 teaspoons of oil and coconut aminos. Roast the veggies and quinoa for about 20 minutes or until the vegetables are tender and golden brown and the quinoa is crispy. Toss as needed to ensure even cooking.",
        "step5: In a serving bowl or mixing bowl, add chopped kale, balsamic vinegar, olive oil, tahini, salt, black pepper, and garlic powder. Massage for 1-2 minutes to combine and slightly tenderize the kale. Set aside.",
        "step6: To serve, top the kale salad with the crispy quinoa and mushrooms, roasted vegetables, and desired additional toppings such as avocado, hemp seeds, toasted almonds, and vegan parmesan cheese (all optional).",
        "step7: Enjoy right away or store leftovers in the refrigerator for up to 24 hours, or 2-3 days if leaving out the avocado."
    ],
      "nutritionInfo": {
        "protein": "12.3 g",
        "carbs": "54.3 g",
        "fat": "23.9 g",
        "fiber": "12.5 g"
      }
    },
    {
      "id": 2,
      "title": "Garlic Butter-Roasted Salmon with Potatoes & Asparagus",
      "image": "https://www.eatingwell.com/thmb/RFwnpHGgQ2sVUHRAkKtqZVhak9o=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/280316-garlic-butter-roasted-salmon-with-potatoes-and-asparagus-beauty-603f5626f1eb440681a8010f63b08bfc.jpg",
      "calories": 522,
      "prepTime": "40 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "baby yukon gold potatoes",
        "extra-virgin olive oil",
        "salt",
        "ground pepper",
        "asparagus",
        "melted butter",
        "lemon juice",
        "garlic",
        "salmon fillet",
        "chopped parsley for garnish"
    ],
      "instructions": [
        "step1: Preheat oven to 400°F (200°C). Toss potatoes with 1 tablespoon olive oil, 1/4 teaspoon salt, and 1/8 teaspoon pepper in a medium bowl. Spread in an even layer on a large rimmed baking sheet. Roast until starting to soften and brown, about 15 minutes.",
        "step2: Meanwhile, toss asparagus with the remaining 1 tablespoon olive oil, 1/8 teaspoon salt, and 1/8 teaspoon pepper in the medium bowl. In a small bowl, combine melted butter, lemon juice, garlic, 1/4 teaspoon salt, and the remaining 1/4 teaspoon pepper.",
        "step3: Sprinkle salmon with the remaining 1/8 teaspoon salt. Move the potatoes to one side of the pan. Place the salmon in the center of the pan; drizzle with the butter mixture. Spread the asparagus on the empty side of the pan.",
        "step4: Roast until the salmon is just cooked through and the vegetables are tender, about 10 to 12 minutes. Garnish with parsley before serving."
    ],
      "nutritionInfo": {
        "protein": "34g",
        "carbs": "26g",
        "fat": "32g",
        "fiber": "4g"
      }
    },
    {
      "id": 3,
      "title": "Dal Palak (Spinach Dal)",
      "image": "https://rainbowplantlife.com/wp-content/uploads/2024/05/Dal-Palak-cover-photo-1-of-1.jpg",
      "calories": 405,
      "prepTime": "45 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "1½ cups of red lentils (split red lentils or split yellow lentils)",
        "4 cups of water",
        "¾ tsp of ground turmeric",
        "1½ tsp of kosher salt",
        "1½ tbsp of freshly squeezed lemon juice",
        "3½ tbsp of unrefined coconut oil",
        "1½ tsp of black or brown mustard seeds",
        "1½ tsp of cumin seeds",
        "1 medium yellow onion, finely diced",
        "4 fat or medium garlic cloves, finely chopped or thinly sliced",
        "1½ fresh ginger, peeled and sliced into thin matchsticks",
        "1 serrano or jalapeño pepper, finely chopped (optional)",
        "2 dried red chile peppers, torn in half",
        "20 fresh curry leaves (optional but highly recommended)",
        "asafoetida (hing) (optional; omit if gluten-free)",
        "5 oz of baby spinach",
        "12 g of cilantro leaves and tender stems, chopped",
        "cooked rice (for serving)"
    ],
      "instructions": [
        "step1: Rinse the lentils in a fine-mesh sieve until the water runs mostly clear.",
        "step2: Add lentils to a medium saucepan and cover with water.",
        "step3: Bring to a boil, skimming off foam as it comes to a boil.",
        "step4: Reduce heat to a simmer, stir in turmeric, and partially cover the pan.",
        "step5: Simmer for 20 to 30 minutes, or until lentils are soft and tender.",
        "step6: Whisk the lentils vigorously until somewhat pureed, about 1 minute.",
        "step7: Cook for a few more minutes, whisking occasionally, until the lentils are completely soft and mashed and the dal has thickened.",
        "step8: Stir in salt and lemon juice, adjusting to taste.",
        "step9: Keep warm over low heat.",
        "step10: Heat a medium or large frying pan over medium-high heat with 3 tablespoons of coconut oil.",
        "step11: Once hot, add mustard seeds and cumin seeds, shaking the pan or stirring frequently until mustard seeds start popping.",
        "step12: Add the onion and a pinch of salt, reducing heat to medium.",
        "step13: Cook until onions are golden brown, about 6 to 8 minutes.",
        "step14: Add garlic, ginger, and serrano pepper (if using).",
        "step15: Cook for 1 to 2 minutes, stirring frequently.",
        "step16: Add dried chiles, curry leaves, and asafoetida, cooking for just 30 seconds.",
        "step17: If the oil has dried up, add 1 tablespoon more coconut oil.",
        "step18: Add half of the spinach and ½ teaspoon kosher salt, tossing with tongs.",
        "step19: Once wilted, add the second half of the spinach and stir-fry until all is wilted.",
        "step20: Pour the spinach tadka over the warm dal, stirring in.",
        "step21: Taste and adjust seasoning with more lemon juice and salt as needed.",
        "step22: Garnish with cilantro and serve with rice."
    ],
      "nutritionInfo": {
        "protein": "20g",
        "carbs": "54g",
        "fat": "12g",
        "fiber": "13g"
      }
    },
    {
      "id": 4,
      "title": "Simple Masoor Dal Recipe (Red Lentil Dal)",
      "image": "https://www.cookwithmanali.com/wp-content/uploads/2025/02/Red-Masoor-Dal-In-a-Pan-topped-with-tadka-1014x1536.jpg",
      "calories": 234,
      "prepTime": "40 mins",
      "servings": 2,
      "category": [],
      "ingredients": [
        "1 cup of red lentil (dhuli masoor dal), dry",
        "1 medium tomato, chopped",
        "1 tsp of salt, divided",
        "1½ tbsp of ghee (or use oil for vegan)",
        "4 large garlic cloves, chopped",
        "1 medium red onion, chopped",
        "½ tsp of kashmiri red chili powder",
        "½ ginger, grated",
        "½ tsp of turmeric",
        "3½ cups of water, divided",
        "¾ tsp of cumin seeds",
        "2 whole dried red chilies, broken",
        "5 curry leaves",
        "1 tbsp of cilantro, chopped (or add as much as you like)"
    ],
      "instructions": [
        "step1: To the steel pot of your Instant Pot, add 1 cup of dry dhuli masoor dal, grated ginger, chopped tomato, ½ teaspoon turmeric, ½ teaspoon salt, and 3 cups of water. Close the lid and press the pressure cook button. Ensure the valve is in the sealing position. Cook on high pressure for 5 minutes and let the pressure release naturally.",
        "step2: While the dal is cooking, prepare the tadka. In a wide pan over medium heat, add 1½ tablespoons of ghee. Once melted, add ¾ teaspoon cumin seeds and let them sizzle.",
        "step3: Add the chopped garlic and broken red chilies to the pan and sauté for 1 minute until the garlic starts to change color.",
        "step4: Add the chopped onions, remaining ½ teaspoon salt, and curry leaves. Cook for around 3 minutes, stirring often, until the onions are caramelized and light golden brown.",
        "step5: Stir in ½ teaspoon Kashmiri red chili powder and cook for an additional 30 seconds.",
        "step6: Add the pressure-cooked dal to the pan and mix until well combined. If needed, add an additional ½ cup of water to adjust the consistency of the dal. Let it simmer on low-medium heat for 3 to 4 minutes.",
        "step7: Stir in 1 tablespoon of chopped cilantro before serving. Serve hot with plain rice or warm rotis."
    ],
      "nutritionInfo": {
        "protein": "13g",
        "carbs": "33g",
        "fat": "6g",
        "fiber": "15g"
      }
    },
    {
      "id": 5,
      "title": "Indian-Spiced Chickpea Curry (Chana Masala)",
      "image": "https://rainbowplantlife.com/wp-content/uploads/2023/02/Hero_01_Chickpea-Curry.jpg",
      "calories": 148,
      "prepTime": "1hr 45 mins",
      "servings": 2,
      "category": [],
      "ingredients": [
        "¼ cup of neutral-flavored oil (such as avocado or grapeseed)",
        "2 medium yellow onions, finely diced",
        "6 large cloves garlic, minced or crushed",
        "1 tbsp of fresh-grated ginger",
        "serrano chiles, de-seeded and minced (or substitute with jalapeños) to taste",
        "2 tsp of garam masala spice mix",
        "2 tsp of ground coriander",
        "1 tsp of whole cumin seeds",
        "1 tsp of ground turmeric",
        "1 tsp of coarse sea salt",
        "¼ tsp of ground black pepper",
        "2 no-salt-added diced tomatoes, with juices",
        "2 no-salt-added chickpeas, rinsed and drained",
        "2 cups of water",
        "fresh cilantro, for garnish to taste",
        "fresh lemon wedges, for squeezing on top to taste",
        "cooked basmati rice or quinoa to taste"
    ],
      "instructions": [
        "step1: Heat the oil over medium-high heat in a deep-sided 5-quart casserole.",
        "step2: Add the onion and cook until tender and starting to caramelize, about 4 to 6 minutes, stirring frequently.",
        "step3: Add the garlic, ginger, chile, garam masala, coriander, cumin seeds, turmeric, salt, and black pepper, and cook for 1 minute more, stirring constantly.",
        "step4: Stir in the diced tomatoes, chickpeas, and water, and bring to a boil.",
        "step5: Cover the skillet, turn the heat down to simmer, and cook until the sauce is thickened, about 1 hour to 1 hour 15 minutes, stirring occasionally.",
        "step6: (If needed, you can remove the lid toward the end of cooking to help it thicken faster, but stay with it and stir frequently.)",
        "step7: Serve with fresh cilantro and lemon, along with prepared basmati rice or quinoa."
    ],
      "nutritionInfo": {
        "protein": "6g",
        "carbs": "18g",
        "fat": "6g",
        "fiber": "4g"
      }
    },
    {
      "id": 6,
      "title": "Cashew Chicken Stir-Fry",
      "image": "https://katescasualportraits.smugmug.com/Other/Food/i-QjZ23Hc/0/L/_DSC3486-L.jpg",
      "calories":  614,
      "prepTime": "22 mins",
      "servings": 2,
      "category": [],
      "ingredients": [
        "4 tbsp of vegetable oil",
        "½ lb of boneless chicken breast, sliced into thin strips",
        "1 tbsp of cornstarch",
        "3 scallions, cut into 2-inch pieces",
        "1 tbsp of fresh ginger, minced",
        "4½ cups of baby spinach",
        "2 tbsp of soy sauce",
        "½ cup of cashews"
    ]
    ,
      "instructions": [
        "step1: Heat oil in a large deep skillet over medium-high heat.",
        "step2: Coat the chicken strips in cornstarch and cook them until golden, about 2 minutes per side.",
        "step3: Remove and set aside.",
        "step4: In the same skillet, add scallions and ginger and stir for about a minute until the scallions start to wilt.",
        "step5: Add the spinach and toss with tongs until the spinach is thoroughly wilted and tender.",
        "step6: Add the soy sauce and toss thoroughly.",
        "step7: Add the chicken and cashews and toss again until everything is mixed together and nice and warm.",
        "step8: Serve at once! Enjoy!"
    ]
    ,
      "nutritionInfo": {
        "protein": "34.2g",
        "carbs": "20g",
        "fat": "46.4g",
        "fiber": " 3.2g"
      }
    },
    {
      "id": 7,
      "title": "Curried Kale, Potato & Lentil Soup",
      "image": "https://minimalistbaker.com/wp-content/uploads/2016/12/SIMPLE-1-Pot-Curried-Lentil-Vegetable-Soup-Easy-hearty-SO-healthy-vegan-glutenfree-curry-soup-recipe-minimalistbaker.jpg",
      "calories":  390,
      "prepTime": "45 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "1 tbsp of coconut oil (or sub a neutral oil, such as avocado)",
        "1 cup of diced yellow or white onion",
        "1 tsp of minced fresh ginger",
        "2 medium whole carrots (peeled and chopped)",
        "A pinch of sea salt + black pepper (plus more to taste)",
        "4 minced garlic",
        "3 cups of diced potatoes (1/2 peeled sweet potato, 1/2 unpeeled baby yellow potato)",
        "1/5 tbsp of curry powder",
        "5 cups of vegetable broth (or store-bought)",
        "1 cup of green lentils (thoroughly rinsed and drained)",
        "1 tbsp of coconut sugar (optional, plus more to taste)",
        "4 cups of chopped green or purple kale",
        "1 fresh chopped cilantro (optional)",
        "1 lemon juice (optional)",
        "1 bread or flatbread (optional)"
    ]
    ,
      "instructions": [
        "step1: Heat a large pot over medium heat.",
        "step2: Once hot, add oil, onion, ginger, and carrots.",
        "step3: Season with a pinch of sea salt and black pepper and stir.",
        "step4: Cook for 3-5 minutes, stirring frequently, until onions are soft and fragrant.",
        "step5: Add garlic and potatoes and stir.",
        "step6: Cook for 3-4 minutes to brown slightly, then add curry powder.",
        "step7: Stir to coat and cook for 2 minutes more.",
        "step8: Add 5 cups of vegetable broth and increase heat to medium-high.",
        "step9: Once at a low boil, add lentils, stir, and reduce heat to low.",
        "step10: Simmer for 20-25 minutes, uncovered, or until lentils and potatoes are tender.",
        "step11: Taste and adjust seasonings, adding coconut sugar for sweetness (optional), more curry powder for intense flavor, or sea salt and pepper for balance.",
        "step12: If the soup has thickened too much, add the remaining vegetable broth, stir, and cook until warmed through.",
        "step13: In the last few minutes of cooking, add the kale and cover to steam until tender but still vibrant green - about 2-3 minutes.",
        "step14: Serve immediately as is or with cilantro and fresh lemon juice (optional).",
        "step15: This soup pairs well with bread or flatbread.",
        "step16: Store leftovers in the refrigerator for up to 5 days or in the freezer for up to 1 month."
    ]
    ,
      "nutritionInfo": {
        "protein": "23.1 g",
        "carbs": "61.6 g",
        "fat": "6.2 g",
        "fiber": "19.9 g"
      }
    },
    {
      "id": 8,
      "title": "Avocado Toast with Poached Egg",
      "image": "https://www.aberdeenskitchen.com/wp-content/uploads/2019/05/Avocado-Egg-Breakfast-Toast-FI-Thumbnail-1200X1200.jpg",
      "calories":  211,
      "prepTime": "10 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "4 eggs",
        "1 avocado",
        "Salt to taste",
        "2 tbsp of chopped fresh parsley",
        "4 whole grain bread",
        "1 tbsp of fresh lemon juice",
        "Pepper to taste"
    ],
      "instructions": [
        "step1: Crack the eggs into individual small dishes and set aside while the water is heating.",
        "step2: Bring a pot of water to a boil, then turn off the heat and carefully tip the eggs into the water.",
        "step3: Cover the pot and poach for 3 to 5 minutes, depending on your preference.",
        "step4: While the eggs are cooking, toast the bread and mash the avocado in a bowl.",
        "step5: Add the lemon juice, salt, and pepper to the mashed avocado.",
        "step6: Plate the toast and spread the mashed avocado equally on each slice.",
        "step7: When the eggs are cooked, lift them out of the water with a slotted spoon.",
        "step8: Blot the bottom of the spoon with a dish towel to remove any excess water before placing a poached egg on each portion of the toast.",
        "step9: Add a grinding of salt and pepper and sprinkle with chopped parsley before serving."
    ]    
    ,
      "nutritionInfo": {
        "protein": "11g",
        "carbs": "17g",
        "fat": "10g",
        "fiber": "4g"
      }
    },
    {
      "id": 9,
      "title": "Banana Chia Spinach Smoothie",
      "image": "https://whatsgabycooking.com/wp-content/uploads/WGC-Banana-Chia-Smoothie-copy.jpg",
      "calories":  216,
      "prepTime": "2 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "2 cups of unsweetened almond milk",
        "1 cup of frozen mango",
        "2 ripe bananas",
        "2 fresh spinach",
        "2 tsp of chia seeds"
    ],
      "instructions": [
        "step1: Place all ingredients in a high-powered blender.",
        "step2: Blend for 2 minutes until smooth.",
        "step3: Divide and serve immediately."
    ]    
    ,
      "nutritionInfo": {
        "protein": "5g",
        "carbs": "43g",
        "fat": "5g",
        "fiber": "7g"
      }
    },
    {
      "id": 10,
      "title": "Oatmeal",
      "image": "https://www.fivehearthome.com/wp-content/uploads/2023/09/Peanut-Butter-Banana-Oatmeal-Recipe-by-FiveHeartHome_1200pxFeatured-1.jpg",
      "calories":  140,
      "prepTime": "10 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "1 cup of water",
        "½ cup of whole rolled oats",
        "a pinch of sea salt",
        "cinnamon, nutmeg, and/or cardamom (optional) to taste",
        "honey or maple syrup (optional) to taste",
        "1 thinly sliced apple",
        "1 frozen tart cherries, thawed",
        "1 chopped almonds",
        "1 frozen blueberries, thawed",
        "1 orange zest",
        "1 greek yogurt",
        "1 chia seeds",
        "1 coconut flakes"
    ]
    ,
      "instructions": [
        "step1: In a small pot, stir together the water, oats, and salt. Bring to a boil over medium-high heat.",
        "step2: Reduce the heat to medium-low and cook, stirring occasionally, for 2 to 5 minutes, or until the oatmeal is thick and creamy.",
        "step3: Stir in a pinch of cinnamon, nutmeg, and/or cardamom, if desired. Remove from heat and let stand for 1 minute.",
        "step4: Serve hot with honey or maple syrup, if desired.",
        "step5: For the Apple & Tart Cherry variation, top with sliced apples, tart cherries, and almonds.",
        "step6: For the Blueberry & Coconut variation, top with blueberries, orange zest, a scoop of Greek yogurt, chia seeds, and coconut flakes."
    ]
    ,
      "nutritionInfo": {
        "protein": "5g",
        "carbs": "28g",
        "fat": "2.5g",
        "fiber": "4g"
      }
    },
    {
      "id": 11,
      "title": "Aloo Gobi Masala (Cauliflower Potato Curry)",
      "image": "https://www.teaforturmeric.com/wp-content/uploads/2018/04/Cauliflower-and-Potato-Curry-Aloo-Gobi-Recipe.jpg",
      "calories":  246,
      "prepTime": "45 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "¼ cup of cooking oil or ghee",
        "1 medium onion, finely chopped",
        "1 tsp of garam masala",
        "¼ tsp of turmeric powder",
        "¼ tsp of chili powder",
        "3 medium tomatoes, finely chopped",
        "2 small russet potatoes, peeled and cut into ½-inch cubes",
        "1 tsp of lemon or lime juice",
        "2 naan bread (optional, for serving)",
        "1 tsp of cumin seeds",
        "3 garlic cloves, crushed",
        "1 tsp of ginger powder",
        "½ tsp of curry powder",
        "1½ tsp of salt",
        "1 small head of cauliflower, cut into small florets",
        "1 small green chili pepper, sliced",
        "2 tbsp of chopped cilantro leaves"
    ]
    ,
      "instructions": [
        "step1: Heat oil in a pot with a non-stick surface or a heavy bottom over medium-high heat. Once heated, add cumin seeds and let them sizzle for a few seconds.",
        "step2: Add chopped onion and sauté, stirring frequently, until the onion is translucent, about 5 minutes.",
        "step3: Add and sauté the garlic for 30 seconds.",
        "step4: Mix in the tomatoes, garam masala, ginger powder, curry powder, turmeric powder, chili powder, and salt. Cook until the tomatoes become tender and the oil starts to separate, about 4 to 5 minutes. If necessary, add 2 tablespoons of water to deglaze the pan.",
        "step5: Incorporate the potatoes, cauliflower, and green chili pepper into the mixture. Sauté for approximately 5 minutes or until they become soft.",
        "step6: Reduce the heat to low-medium, cover the pan, and allow the mixture to cook for approximately 20 minutes or until the cauliflower and potatoes are fork-tender, stirring occasionally. Add a splash of water if the sauce starts sticking to the bottom of the pan.",
        "step7: Finish with lemon or lime juice and chopped cilantro leaves. Serve with naan bread if desired."
    ]
    ,
      "nutritionInfo": {
        "protein": "5g",
        "carbs": "28g",
        "fat": "14g",
        "fiber": "5g"
      }
    },
    {
      "id": 12,
      "title": "Paneer Tikka Masala",
      "image": "https://amritsruae.com/blog/wp-content/uploads/2022/01/paneer-tikka-masala-800x510.jpg",
      "calories":  367,
      "prepTime": "1 hr 30 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "½ cup of thick plain yogurt (Greek yogurt or strained homemade yogurt)",
        "½ tsp of ginger-garlic paste",
        "1 tsp of coriander powder",
        "1 tsp of garam masala",
        "½ tsp of Kashmiri red chili powder (for color)",
        "½ tsp of red chili powder (or to taste)",
        "½ juice of lime",
        "250 g of paneer (cut into cubes)",
        "1 medium red onion (quartered and separated into petals)",
        "1 medium green pepper (cut into 1-inch cubes)",
        "1 tbsp of oil (avocado oil or oil of choice)",
        "1 tbsp of butter (divided, unsalted or salted)",
        "1 2-inch cinnamon stick",
        "4-5 green cardamom seeds",
        "4 large white onions (roughly chopped)",
        "4 large garlic cloves (chopped)",
        "1 ginger (chopped)",
        "3 large tomatoes (roughly chopped)",
        "½ tsp of curry powder",
        "½ tsp of Kashmiri red chili powder (divided)",
        "½ tsp of salt (or to taste)",
        "1 tbsp of sugar (granulated white sugar)",
        "1 cup of water (or more as needed)",
        "2 tbsp of heavy cream",
        "1 tbsp of chopped cilantro"
    ]
    ,
      "instructions": [
        "step1: In a large bowl, combine the yogurt, ginger-garlic paste, coriander powder, garam masala, Kashmiri red chili powder, red chili powder, salt, and lime juice. Mix until well combined.",
        "step2: Add the cubed paneer, quartered onions, and green pepper to the marinade. Mix until everything is well coated. Cover and refrigerate for at least 30 minutes.",
        "step3: Heat oil and 1 tablespoon of butter in a pan over medium heat. Add the cumin seeds and the cinnamon stick, letting them sizzle.",
        "step4: Add the chopped white onions, garlic, and ginger. Cook for about 5-6 minutes until the onions turn light golden brown.",
        "step5: Add the chopped tomatoes, curry powder, Kashmiri red chili powder, and sugar. Stir and cook for 7-8 minutes until the tomatoes are soft.",
        "step6: Remove the pan from heat, let it cool slightly, then remove the cinnamon stick and blend the mixture into a fine paste. Set aside.",
        "step7: Remove the marinated paneer from the refrigerator. Cook the paneer, onions, and peppers in a grill pan or oven until the paneer is light golden brown and the vegetables are slightly cooked. (For oven: arrange on skewers and bake at 450°F for 10 minutes, then broil for 2-3 minutes.)",
        "step8: In a large pan, mix the blended curry paste to medium heat. Add 1 cup of water (or more for desired gravy consistency) and stir well.",
        "step9: Add the marinated butter, cream, and chopped cilantro. Mix and let it cook for 2 minutes.",
        "step10: Add the grilled paneer, onions, and peppers into the curry. Mix well and let it simmer for 2-3 minutes.",
        "step11: Garnish with additional cilantro and serve with naan or parathas."
    ]
    ,
      "nutritionInfo": {
        "protein": "12g",
        "carbs": "21g",
        "fat": "27g",
        "fiber": "4g"
      }
    },
    {
      "id": 13,
      "title": "Tawa Pulao",
      "image": "https://www.indianhealthyrecipes.com/wp-content/uploads/2022/03/tawa-pulao-recipe.jpg",
      "calories":  306,
      "prepTime": "50 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "10 whole dry Kashmiri red chilies",
        "1 large garlic clove",
        "1 cup of basmati rice (preferably sela basmati rice)",
        "3 tbsp of butter (preferably unsalted butter)",
        "1 tbsp of oil (any oil of choice)",
        "1 tsp of cumin seeds",
        "1 medium red onion, sliced",
        "1 tsp of ginger-garlic paste",
        "1 medium green pepper, thinly sliced",
        "1/4 cup of cabbage, sliced",
        "1 large tomato, quartered",
        "1/2 cup of green peas (frozen, boiled for 10 minutes beforehand)",
        "1 medium potato, boiled and cubed",
        "1/2 tsp of turmeric",
        "1/2 tsp of hot masala",
        "1/2 tsp of salt",
        "1/4 cup of kasuri methi (dried fenugreek leaves)",
        "3 tbsp of chopped cilantro",
        "1/2 juice of lemon"
    ]
    ,
      "instructions": [
        "step1: Soak the whole dried Kashmiri red chilies in hot water for about 30 minutes.",
        "step2: Drain and cut open the chilies to remove seeds.",
        "step3: Blend the de-seeded chilies with garlic clove and a little water (2-3 tablespoons) until you have a thick paste.",
        "step4: Set aside.",
        "step5: Rinse the basmati rice until the water runs clear, then soak it in 3 cups of water for 15-20 minutes.",
        "step6: Drain and set aside.",
        "step7: Bring a pot of water (about 6-7 cups) to a boil, add a few drops of oil, and then add the soaked and drained rice.",
        "step8: Cook until the rice is 95% cooked (about 10 minutes for sela basmati).",
        "step9: Drain the rice and let it cool for 5 minutes, then fluff with a fork.",
        "step10: In a pan or wok, heat 2 tablespoons of butter and 1 tablespoon of oil.",
        "step11: Add cumin seeds and let them sizzle.",
        "step12: Add sliced onions and cook until translucent (about 2 minutes).",
        "step13: Add ginger-garlic paste and cook for 1 minute.",
        "step14: Stir in 1 tablespoon - 1 teaspoon of the prepared chili-garlic paste (adjust to taste) and cook for 1 minute.",
        "step15: Add the sliced green pepper, cabbage, quartered tomatoes, boiled green peas, and boiled cubed potatoes.",
        "step16: Stir and cook for 2 minutes.",
        "step17: Add turmeric, hot masala, and salt.",
        "step18: Stir well and add about 2 tablespoons of water to prevent burning.",
        "step19: Cook for another 2-3 minutes.",
        "step20: Add the prepared rice to the pan and mix until well combined with the vegetables and spices.",
        "step21: Garnish with kasuri methi, chopped cilantro, and squeeze in fresh lemon juice.",
        "step22: Optionally, add a pat of butter on top before serving."
    ]
    ,
      "nutritionInfo": {
        "protein": "6g",
        "carbs": "48g",
        "fat": "10g",
        "fiber": "4g"
      }
    },
    {
      "id": 14,
      "title": "Moong Dal Chilla",
      "image": "https://ministryofcurry.com/wp-content/uploads/2022/06/Mung-Dal-Chilla_-5.jpg",
      "calories":  285,
      "prepTime": "1 hr 40 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "1 cup of moong dal (green gram lentils)",
        "3 cups of water (for soaking lentils)",
        "1 green chili",
        "1 ginger",
        "1 tsp of cumin seeds",
        "1½ tsp of kosher salt",
        "1 cup of water (divided for the batter)",
        "½ tsp of ground turmeric",
        "4 tbsp of rice flour",
        "½ cup of red onion, finely diced",
        "2 tbsp of cilantro, finely chopped",
        "2 tbsp of oil (for cooking)"
    ]
    ,
      "instructions": [
        "step1: Rinse and drain the moong dal and soak it in water overnight or for at least 2 hours.",
        "step2: Drain out all the water. Add the soaked dal to a blender jar.",
        "step3: Add the green chili, ginger, cumin seeds, salt, and half of the water. Blend together to make a fine batter.",
        "step4: Transfer the batter to a mixing bowl. Add turmeric, rice flour, and the remaining water, and mix well.",
        "step5: Add the diced onions and chopped cilantro to the batter and mix well. Let the batter rest for five minutes.",
        "step6: Preheat a non-stick pan over low-medium heat and lightly oil it.",
        "step7: Pour around ½ cup of batter onto the pan and spread it into a 5 to 6-inch circle. Cook on medium heat for 2 to 3 minutes.",
        "step8: Add a few drops of oil around the edges and carefully flip the chilla. Drizzle some oil on top and cook for another 2 to 3 minutes or until light brown marks appear.",
        "step9: Remove the chilla from the pan and repeat with the remaining batter."
    ]
    ,
      "nutritionInfo": {
        "protein": "14g",
        "carbs": "40g",
        "fat": "8g",
        "fiber": "6g"
      }
    },
    {
      "id": 15,
      "title": "Tandoori Chicken",
      "image": "https://www.onceuponachef.com/images/2015/01/tandoori-chicken-1-1120x1517.jpg",
      "calories":  807,
      "prepTime": "1 hr 30 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "1 tbsp of paprika",
        "1 tbsp of garam masala (or curry powder)",
        "1 tbsp of ground cumin",
        "1 tbsp of ground coriander",
        "½ tsp of ground turmeric",
        "½ tsp of cayenne pepper",
        "3 tbsp of fresh ginger (peeled and roughly chopped)",
        "7 garlic cloves (peeled and roughly chopped)",
        "¼ cup of whole milk Greek yogurt",
        "1 tsp of lime zest and juice",
        "2 tbsp of lime juice",
        "¼ cup of vegetable oil",
        "2½ tsp of salt",
        "12 chicken drumsticks",
        "mango chutney (for serving, optional)",
        "cilantro (for garnishing, optional)",
        "lime wedges (for serving, optional)"
    ]
    ,
      "instructions": [
        "step1: In a small pan over medium-low heat, combine the paprika, garam masala, cumin, coriander, turmeric, and cayenne pepper. Cook, stirring frequently, for about 2 minutes, until the spices are fragrant.",
        "step2: Add the toasted spices to a blender or mini food processor, along with the ginger, garlic, Greek yogurt, lime zest and juice, oil, and salt; process until smooth.",
        "step3: Using a very sharp knife, make 2 or 3 slashes in each drumstick to increase the surface area for the marinade to penetrate.",
        "step4: Place the drumsticks in a large bowl and toss with the marinade. Cover and refrigerate for at least 3 hours or overnight.",
        "step5: Preheat the oven to 450°F (232°C). Line a baking sheet with heavy-duty aluminum foil and set an oven-proof rack over top. Spray the rack with nonstick cooking spray or grease with vegetable oil.",
        "step6: Arrange the chicken on the rack, leaving a bit of space between the pieces. Spoon any leftover marinade evenly over the drumsticks.",
        "step7: Roast for 45 minutes, turning once midway through, until the chicken is golden brown and cooked through.",
        "step8: Turn on the broiler and broil the chicken about 6 inches from the heat for 3-5 minutes, until lightly charred and crisp all over.",
        "step9: Transfer the chicken to a platter and garnish with cilantro sprigs and lime wedges. Serve with mango chutney on the side."
    ]
    ,
      "nutritionInfo": {
        "protein": "73g",
        "carbs": "8g",
        "fat": "53g",
        "fiber": "2g"
      }
    },
    {
      "id": 16,
      "title": "Punjabi Kadhi Pakora",
      "image": "https://mytastycurry.com/wp-content/uploads/2020/06/Kadhi-pakora-1.jpg",
      "calories":  460,
      "prepTime": "1 hr 5 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "½ cup of besan",
        "1½ cups of plain yogurt",
        "½ tsp of red chili powder",
        "½ tsp of turmeric powder",
        "1 tsp of coriander powder",
        "6 cups of water",
        "2 tbsp of mustard oil (or any oil)",
        "½ tsp of methi seeds (fenugreek seeds)",
        "½ tsp of cumin seeds",
        "¼ tsp of hing (asafoetida)",
        "1 red onion, sliced thin",
        "1 green chili, chopped",
        "1 tbsp of chopped ginger",
        "1 tbsp of chopped garlic",
        "1⅓ tsp of salt (to taste)",
        "2 tbsp of chopped cilantro",
        "1 cup of besan (for pakora)",
        "1 cup of thinly sliced onion (from 1 large red onion)",
        "1 green chili, chopped (for pakora)",
        "¼ cup of chopped cilantro (for pakora)",
        "¼ tsp of turmeric powder (for pakora)",
        "½ tsp of red chili powder (for pakora)",
        "½ tsp of coriander seeds",
        "¼ tsp of ajwain",
        "½ tsp of salt (for pakora)",
        "2 tbsp of plain yogurt (for pakora)",
        "¼ cup of water (for pakora)",
        "a pinch of baking soda",
        "oil (for frying)",
        "1½ tbsp of ghee (or use oil for tadka)",
        "¼ tsp of cumin seeds (for tadka)",
        "a pinch of ajwain (for tadka)",
        "2 whole dried red chilies",
        "½ tsp of kashmiri red chili powder (for color)"
    ]
    ,
      "instructions": [
        "step1: In a large bowl, add 1/2 cup besan and 1.5 cups yogurt. Ensure the yogurt is at room temperature.",
        "step2: Whisk until the besan and yogurt are well combined.",
        "step3: Add 1/2 tsp red chili powder, 1/2 tsp turmeric powder, and 1 tsp coriander powder. Whisk until you have a lump-free mixture.",
        "step4: Add 6 cups of water and mix until combined. Set aside.",
        "step5: In a large and deep pan, heat 2 tbsp mustard oil over medium-high heat.",
        "step6: Once the oil is hot, add methi seeds and cumin seeds. Let them splutter, then add hing.",
        "step7: Add the sliced onion and chopped green chili. Cook for 2 minutes.",
        "step8: Add the chopped ginger and garlic, cooking for another minute until they start changing color.",
        "step9: Pour the prepared besan-yogurt mixture into the pan. Stir continuously until the kadhi comes to a boil.",
        "step10: Once boiling, lower the heat to low-medium and let it cook for around 30 minutes, stirring occasionally.",
        "step11: Add the pakoras to the kadhi that has been cooking for about 15 minutes.",
        "step12: In a large bowl, combine 1 cup besan, 1 cup sliced onion, 1 chopped green chili, 1/4 cup chopped cilantro, 1/4 tsp turmeric powder, 1/4 tsp red chili powder, 1/2 tsp coriander seeds, 1/4 tsp ajwain, and 1/2 tsp salt.",
        "step13: Add 2 tbsp yogurt and mix.",
        "step14: Gradually add water to form a thick batter (not too runny or too thick). Approximately 1/4 cup and 2 tbsp of water should suffice.",
        "step15: Add a pinch of baking soda and mix the batter for a minute using your hands.",
        "step16: Heat around 2 cups of oil in a kadai over medium heat for frying the pakoras.",
        "step17: Once the oil is hot, dip the batter again and drop spoonfuls into the hot oil.",
        "step18: Cook until golden brown on both sides, then flip and cook the other side. Ensure to cook on medium-low heat for even cooking.",
        "step19: Drain the pakoras on a paper towel.",
        "step20: After 30 minutes, the kadhi should have thickened and cooked completely. Add chopped cilantro. If the kadhi is too thick, add a little more water.",
        "step21: Add the pakoras to the kadhi and transfer it to a serving pan.",
        "step22: In a small pan, heat ghee over medium heat. Once hot, add 1/4 tsp cumin seeds and a generous pinch of ajwain.",
        "step23: Add 2-3 dried red chilies (breaking them for extra heat).",
        "step24: Once the seeds crackle, add 1/2 tsp kashmiri red chili powder and turn off the heat immediately.",
        "step25: Pour the tadka over the kadhi, garnish with more cilantro, and serve with rice."
    ]
    ,
      "nutritionInfo": {
        "protein": "15g",
        "carbs": "42g",
        "fat": "19g",
        "fiber": "7g"
      }
    },
    {
      "id": 17,
      "title": "Rajma(Red Kidney Bean Curry)",
      "image": "https://silkroadrecipes.com/wp-content/uploads/2021/10/Rajma-Masala-Kidney-Bean-Curry-square.jpg",
      "calories":  269,
      "prepTime": "30 mins",
      "servings": 2,
      "category": [],
      "ingredients": [
        "¼ cup of extra virgin olive oil",
        "2 tbsp of minced fresh ginger",
        "1 medium onion, finely chopped",
        "1 plum tomato, diced",
        "3 chopped garlic",
        "1 large green chile, chopped (optional)",
        "1 tsp of salt",
        "1 tsp of ground cumin",
        "1 tsp of ground coriander",
        "¼ tsp of cumin seeds",
        "½ tsp of ground turmeric",
        "¼ tsp of cayenne",
        "1 tomato sauce (8-ounce can or 1 cup)",
        "3 cups of cooked red kidney beans or 15-ounce cans (drained and rinsed)",
        "½ cup of chopped fresh cilantro (or parsley)"
    ]
    ,
      "instructions": [
        "step1: Heat oil in a deep saucepan over medium heat for one minute.",
        "step2: Add ginger, garlic, onion, and green chile, and let sizzle for one minute.",
        "step3: Add the tomato sauce, salt, and remaining spices, and cook for an additional five minutes, stirring frequently.",
        "step4: Add red kidney beans plus 2 additional cups of water and diced tomatoes. Bring to a boil.",
        "step5: Reduce to medium heat and let cook uncovered for 10 minutes.",
        "step6: Remove from heat and garnish with cilantro.",
        "step7: Serve over rice or with naan. Optionally, add a dollop of plain yogurt on top if not keeping the dish vegan."
    ]
    ,
      "nutritionInfo": {
        "protein": "7g",
        "carbs": "24g",
        "fat": "8g",
        "fiber": "6g"
      }
    },
    {
      "id": 18,
      "title": "Methi Paratha",
      "image": "https://rotimatic.com/cdn/shop/articles/Methi_Paratha_500x500.jpg?v=1718439269",
      "calories":  144,
      "prepTime": "1 hr 15 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "2 cups of whole wheat flour (atta)",
        "2 cups of chopped fresh methi leaves",
        "¼ tsp of garam masala",
        "¼ tsp of ajwain (carom seeds)",
        "1 green chili, finely chopped",
        "¼ tsp of salt",
        "2 tsp of oil (for dough)",
        "¾ cup of water (to knead the dough)",
        "oil (for cooking the parathas)"
    ]
    ,
      "instructions": [
        "step1: In a large bowl, combine the whole wheat flour, chopped methi leaves, garam masala, ajwain, chopped green chili, salt, and 2 teaspoons of oil.",
        "step2: Gradually add water, little by little, to knead the mixture into a smooth and soft dough. You will need approximately 1/2 to 3/4 cup of water, depending on the quality of the flour. Cover the dough and let it rest for 20 minutes.",
        "step3: After resting, divide the dough into 8 equal parts, each weighing around 65-67 grams. Meanwhile, heat a tawa or iron skillet on medium-high heat.",
        "step4: Take one dough ball (keeping the others covered to prevent drying out) and roll it between your palms to form a round shape. Flatten it and start rolling it out using a rolling pin, dusting with dry flour as needed, until you achieve a circle of about 6-7 inches in diameter.",
        "step5: Place the rolled paratha onto the hot tawa. Cook for about a minute, then flip it over.",
        "step6: Apply approximately 1/4 teaspoon of oil on the half-cooked side and flip again.",
        "step7: Apply oil on the other side as well. Press with a spatula and cook the paratha until both sides have golden brown spots.",
        "step8: Repeat the process with the remaining dough balls to make all the parathas.",
        "step9: Serve the methi parathas with pickle, yogurt, and a cup of chai."
    ]
    ,
      "nutritionInfo": {
        "protein": "6g",
        "carbs": "26g",
        "fat": "2g",
        "fiber": "4g"
      }
    },
    {
      "id": 19,
      "title": "Baingan Bharta (Roasted Eggplant Mash)",
      "image": "https://www.kuchpakrahahai.in/wp-content/uploads/2016/05/Baingan-ka-bharta.jpg",
      "calories":  114,
      "prepTime": "30 mins",
      "servings": 2,
      "category": [],
      "ingredients": [
        "1 medium eggplant",
        "3 large garlic cloves (for roasting)",
        "½ tbsp of oil (vegetable oil recommended)",
        "4 large garlic cloves, chopped",
        "1 inch ginger, chopped",
        "1 green chili, chopped (or to taste)",
        "1 medium red onion, chopped",
        "2 medium tomatoes, chopped",
        "¼ tsp of red chili powder (or to taste)",
        "1 tsp of coriander powder",
        "¼ tsp of salt (or to taste)",
        "2 tbsp of chopped cilantro"
    ]
    ,
      "instructions": [
        "step1: Rinse the eggplant and pat dry. Brush it with a little oil all over. Make a few slits in the eggplant with a knife and insert a large clove of garlic into three of those slits.",
        "step2: Put the eggplant directly on heat and roast, turning often for around 10-12 minutes until completely roasted. To check if it's done, insert a knife into the eggplant; it should go in easily.",
        "step3: Use tongs to remove the eggplant from heat and wrap it in aluminum foil to cool.",
        "step4: Once cooled, remove the skin and chop the roasted garlic.",
        "step5: Transfer the roasted eggplant to a bowl and mash using a fork or potato masher. Set aside.",
        "step6: Heat oil in a pan over medium heat. Once hot, add the chopped garlic (different from the ones used while roasting the eggplant), ginger, and green chili. Sauté until they start changing color, around 2 minutes.",
        "step7: Add the chopped onion and cook for 2-3 minutes until softened, but do not brown them.",
        "step8: Add the chopped tomatoes and mix. Cook the tomatoes for around 5 minutes until very soft and oil starts to ooze out of the masala.",
        "step9: Add the mashed roasted eggplant into the pan along with the chopped roasted garlic and mix well.",
        "step10: Add the red chili powder, coriander powder, and salt. Mix to combine and cook the bharta for another 5 minutes on medium-low heat, stirring often.",
        "step11: Stir in the chopped cilantro and mix. Remove the pan from heat.",
        "step12: Serve baingan bharta hot with fresh rotis or parathas. Enjoy!"
    ]
    ,
      "nutritionInfo": {
        "protein": "3g",
        "carbs": "4g",
        "fat": "10g",
        "fiber": "1g"
      }
    },
    {
      "id": 20,
      "title": "Masala Oats Idli",
      "image": "https://madscookhouse.com/wp-content/uploads/2021/12/Masala-Oats-Idli.jpg",
      "calories":  61,
      "prepTime": "35 mins",
      "servings": 8,
      "category": [],
      "ingredients": [
        "1 cup of rolled oats, powdered",
        "1 tbsp of oil (use oil of choice)",
        "½ tsp of cumin seeds",
        "½ tsp of mustard seeds",
        "¼ tsp of hing (asafoetida)",
        "1 cup of urad dal",
        "1 tsp of chana dal",
        "1 green chili, chopped",
        "1 tsp of chopped ginger",
        "¼ cup of sooji (semolina)",
        "1 large carrot, grated",
        "½ cup of frozen green peas, soaked in warm water for 10 minutes",
        "3 tbsp of chopped cilantro",
        "½ tsp of turmeric powder",
        "¼ tsp of smoked paprika (optional)",
        "¼ tsp of black pepper",
        "½ tsp of salt (or to taste)",
        "¼ cup of plain yogurt",
        "½ cup of water",
        "¼ tsp of fruit salt (eno)",
        "1 tbsp of water (optional)"
    ]
    ,
      "instructions": [
        "step1: Transfer 1 cup rolled oats to your blender and grind to a fine powder. Set it aside.",
        "step2: Heat 1 tablespoon oil in a pan on medium heat. Add cumin seeds, mustard seeds, and hing. Let the seeds sizzle.",
        "step3: Add chana dal and urad dal. Sauté until the dals are light golden in color. Add green chili and ginger, and sauté for a minute until the ginger starts changing color.",
        "step4: Add in sooji, lower the heat to low-medium, and cook for 3 minutes, stirring continuously.",
        "step5: Then add the oats powder and mix. On low heat, stir constantly and cook for 5-6 minutes until the mixture turns a little golden brown and there's no raw smell. Transfer this mixture to a bowl and let it cool.",
        "step6: Once the oat-sooji mixture has cooled down, add grated carrot, green peas, and chopped cilantro. Also add turmeric, smoked paprika (if using), black pepper, and salt. Mix to combine.",
        "step7: Add yogurt and water, and mix to combine everything together. The batter should be thick. Let it sit for 10 minutes.",
        "step8: Meanwhile, grease your idli molds with non-stick spray. Pour 1-1.5 cups water into your steamer (or Instant Pot).",
        "step9: Once the batter has rested, add the fruit salt/eno and 1 tablespoon water if the batter looks too thick. Mix immediately and stir well to distribute the eno throughout the mixture.",
        "step10: Pour the batter into the prepared idli molds. Steam for 12-13 minutes until the idlis are done & knife inserted should come out clean.",
        "step11: Remove the idli stand carefully from the pot. Serve masala oats idli with onion tomato chutney and sambar."
    ]
    ,
      "nutritionInfo": {
        "protein": "2g",
        "carbs": "9g",
        "fat": "1g",
        "fiber": "1g"
      }
    },
    {
      "id": 21,
      "title": "Breakfast Scramble with Eggs and Sweet Potatoes",
      "image": "https://www.bhg.com/thmb/0DxHAMUQy_6YMNFLwfPIp7NRum0=/4000x0/filters:no_upscale():strip_icc()/bhg-recipe-savory-egg-and-sweet-potato-scramble-hero-01-49ae74dd0a9f446a88da320df225428b.jpg",
      "calories":  528,
      "prepTime": "25 mins",
      "servings": 2,
      "category": [],
      "ingredients": [
        "1 tbsp of olive oil",
        "2 cups of sweet potatoes, diced into 1/4-inch pieces",
        "4 large eggs",
        "1/4 cup of milk",
        "1/2 tsp of salt",
        "1/4 tsp of pepper",
        "1/2 cup of shredded smoked cheddar cheese",
        "1/4 cup of salsa",
        "1/4 cup of tortilla chips",
        "1 fresh cilantro (for garnish)"
    ]
    ,
      "instructions": [
        "step1: Heat the olive oil in a skillet over medium-high heat.",
        "step2: Add the sweet potatoes and cook, stirring occasionally, until browned and tender, about 8 minutes.",
        "step3: While the potatoes are cooking, whisk together the eggs, milk, salt, and pepper in a bowl.",
        "step4: Once the sweet potatoes are tender, reduce the heat to medium-low.",
        "step5: Pour the egg mixture over the potatoes in the skillet.",
        "step6: Cook gently, pulling the eggs to the middle of the pan as they cook.",
        "step7: When the eggs are almost set, remove from heat and top with the shredded cheese.",
        "step8: Cover the pan until the cheese has melted.",
        "step9: Serve the eggs and potatoes over the tortilla chips, and top with salsa and fresh cilantro."
    ]
    ,
      "nutritionInfo": {
        "protein": "24g",
        "carbs": "49g",
        "fat": "26g",
        "fiber": "4g"
      }
    },
    {
      "id": 22,
      "title": "Chicken Quinoa Salad with Apple Vinaigrette",
      "image": "https://www.primaverakitchen.com/wp-content/uploads/2023/05/chicken-quinoa-salad-Primavera-Kitchen-1-2.jpg",
      "calories":  418,
      "prepTime": "50 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "1 ½ lb of boneless skinless chicken breast fillets",
        "Salt and pepper to taste",
        "¼ cup of apple cider vinegar",
        "½ cup of quinoa",
        "½ cup of water",
        "3 tbsp of raisins",
        "¼ cup of apple cider vinegar (for vinaigrette)",
        "1 tbsp of Dijon mustard",
        "1 tbsp of honey",
        "1 tsp of ground cumin",
        "1 tsp of paprika",
        "¼ tsp of cayenne",
        "¼ cup of olive oil",
        "1 granny smith apple, peeled and diced small",
        "4 radishes, trimmed, halved, and thinly sliced",
        "¼ head of red cabbage, julienned",
        "¼ lacinto or dinosaur kale, julienned",
        "3 tbsp of toasted pine nuts for garnish"
    ]
    ,
      "instructions": [
        "step1: To prepare the chicken, season the fillets generously on both sides with salt and pepper. Place them in a dish and pour the apple cider vinegar over them. Refrigerate for about 30 minutes.",
        "step2: While the chicken is marinating, cook the quinoa. Combine the quinoa and water in a saucepan and bring to a boil over high heat. Reduce the heat to low, cover, and simmer for about 15 minutes, until the grains are tender and most of the water has been absorbed. Transfer to a large bowl and stir in the raisins.",
        "step3: Preheat the oven to 400°F (200°C).",
        "step4: Heat a lightly oiled grill or grill pan to medium-high heat (you could also use an oven-safe skillet). Remove the chicken from the marinade, discarding the marinade, and grill until browned, about 3 minutes per side. Transfer the chicken to the oven (if using an oven-safe skillet or grill pan, you can transfer the whole thing to the oven; otherwise, place the chicken in a baking dish), and cook for about 15 minutes, until the chicken is cooked through. Remove from the oven, transfer to a cutting board, and let rest for 10 minutes. Slice into ¼-inch thick pieces.",
        "step5: While the chicken is cooking, make the vinaigrette. In a bowl, whisk together the apple cider vinegar, Dijon mustard, honey, cumin, paprika, cayenne, and salt. Stir in the diced apple and let sit for about 5 minutes. Stir in the olive oil.",
        "step6: To make the salad, add the radishes, kale, and cabbage to the quinoa and mix well. Add the dressing and toss until well combined.",
        "step7: Serve the salad in individual bowls and top with the chicken strips. Garnish with toasted pine nuts and serve immediately."
    ]
    ,
      "nutritionInfo": {
        "protein": "20g",
        "carbs": "30g",
        "fat": "25g",
        "fiber": "5g"
      }
    },
    {
      "id": 23,
      "title": "Banana Peanut Butter and Date Smoothie",
      "image": "https://simple-veganista.com/wp-content/uploads/2014/06/best-date-smoothie-recipe.jpg",
      "calories":   510,
      "prepTime": "5 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "1 cup of unsweetened plain almond milk",
        "4 pitted dates",
        "2 tbsp of natural creamy peanut butter",
        "1 your favorite protein powder (optional)",
        "1 ripe banana",
        "1 frozen banana",
        "¼ cup of ice"
    ]
    ,
      "instructions": [
        "step1: Place all ingredients into a power blender (like a Vitamix) and blend until smooth.",
        "step2: If you like it thinner, add more almond milk."
    ]
    ,
      "nutritionInfo": {
        "protein": "12g",
        "carbs": "81g",
        "fat": "19g",
        "fiber": "11g"
      }
    },
    {
      "id": 24,
      "title": "Maple Roasted Chicken Thighs with Vegetables",
      "image": "https://www.theseasonedmom.com/wp-content/uploads/2022/12/Maple-Roasted-Chicken-Thighs-with-Vegetables-5.jpg",
      "calories":   657,
      "prepTime": "1 hr",
      "servings": 4,
      "category": [],
      "ingredients": [
        "¼ cup of olive oil",
        "kosher salt to taste",
        "2 fresh rosemary sprigs",
        "12 oz of brussels sprouts (trimmed and halved)",
        "1 garlic (grated)",
        "1 tbsp of butter (melted)",
        "1 tbsp of apple cider vinegar",
        "1 optional garnish (chopped fresh rosemary or other herbs)",
        "4 bone-in, skin-on chicken thighs",
        "ground black pepper to taste",
        "2 medium sweet potatoes (cut into wedges)",
        "2 large shallots (halved and peeled)",
        "¼ cup of maple syrup",
        "2 tbsp of dijon mustard",
        "1 tsp of worcestershire sauce"
    ]
    ,
      "instructions": [
        "step1: Arrange a rack in the lower third of the oven and preheat to 400°F (200°C).",
        "step2: Heat 1 tablespoon of olive oil in a large (12-14 inch) cast iron skillet over medium-high heat.",
        "step3: Pat the chicken dry with a paper towel and season with salt and pepper to taste. Place the chicken skin-side down in the hot skillet and add the rosemary sprigs. Cook until the chicken is golden and crisp, about 10 minutes. Flip the chicken and continue cooking until golden on both sides, about 4-5 more minutes. Transfer the chicken to a plate or tray and discard the rosemary.",
        "step4: Pour the drippings from the skillet into a small bowl and reserve for later. Add about 1/4 cup of water to the skillet and stir with a wooden spoon to loosen browned bits from the bottom of the pan. Discard the liquid and wipe the skillet clean.",
        "step5: Heat the remaining 3 tablespoons of olive oil in the skillet over medium-high heat. Add the sweet potatoes and cook for 2 minutes. Add the Brussels sprouts and shallots, seasoning the vegetables with salt and pepper to taste. Cook until charred, about 5 minutes. Remove the skillet from the heat.",
        "step6: In the small bowl with the reserved drippings, add the garlic, maple syrup, melted butter, Dijon mustard, cider vinegar, and Worcestershire sauce; whisk to combine.",
        "step7: Place the chicken skin-side up on top of the vegetables in the skillet. Pour the maple sauce evenly over the chicken and vegetables.",
        "step8: Transfer the skillet to the preheated oven and bake until the vegetables are tender and the chicken reaches an internal temperature of 160-165°F, about 15-20 minutes (typically around 18 minutes).",
        "step9: Remove the skillet from the oven and let the chicken rest for about 5-10 minutes before serving. Taste and season with additional salt and pepper. Garnish with chopped fresh herbs, if desired."
    ]
    ,
      "nutritionInfo": {
        "protein": "29g",
        "carbs": "45g",
        "fat": "41g",
        "fiber": "7g"
      }
    },
    {
      "id": 25,
      "title": "Spaghetti Squash Pasta with Basil Pesto",
      "image": "https://minimalistbaker.com/wp-content/uploads/2015/09/AMAZING-9-ingredient-Spaghetti-Squash-Pasta-with-Simple-VEGAN-Pesto-veagn-pesto-glutenfree-pasta-healthy.jpg",
      "calories":   352,
      "prepTime": "55 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "1 large spaghetti squash",
        "1/4 cup of raw cashews",
        "1/4 cup of toasted pine nuts (or raw walnuts)",
        "2 tbsp of nutritional yeast",
        "1/4 tsp of sea salt",
        "2 cups of fresh basil (packed)",
        "3 garlic cloves (minced)",
        "3 tbsp of sun-dried tomatoes (chopped, drained if in oil)",
        "1/4 cup of extra virgin olive oil",
        "Toasted pine nuts (for serving, optional)",
        "Vegan parmesan cheese (for serving, optional)",
        "Red pepper flakes (for serving, optional)",
        "Garlic bread (for serving, optional)"
    ]
    ,
      "instructions": [
        "step1: Preheat the oven to 400°F (204°C) and line a large baking sheet with foil.",
        "step2: Carefully halve the spaghetti squash lengthwise using a sharp knife. Scoop out the seeds and stringy parts with an ice cream scoop or spoon.",
        "step3: Brush the interior of the squash with oil and sprinkle with a little salt. Place cut-side down on the baking sheet and roast for 45 minutes, or until a knife easily pierces the skin and flesh. Remove from the oven and set aside.",
        "step4: In the meantime, add cashews, pine nuts, nutritional yeast, and sea salt to a blender or food processor and pulse until a fine meal.",
        "step5: Add basil, garlic, sun-dried tomatoes, and olive oil to the blender and puree into a fine paste. If it has trouble mixing, add a bit more oil or hot water (2-3 tablespoons) to help it along. It doesn’t need to be finely pureed; a bit of texture is good.",
        "step6: Use a fork to scoop out the spaghetti squash into fine strings and divide between serving plates. Top with desired amount of pesto and lightly toss.",
        "step7: Serve with additional toppings as desired, such as red pepper flakes and vegan parmesan cheese.",
        "step8: Store leftovers covered in the refrigerator for 2-3 days, though best when fresh. Pasta can be enjoyed hot, chilled, or at room temperature."
    ]
    ,
      "nutritionInfo": {
        "protein": "8.3 g",
        "carbs": "33.3 g",
        "fat": "23.6 g",
        "fiber": "8.3 g"
      }
    },
    {
      "id": 26,
      "title": "Simple Pumpkin Soup",
      "image": "https://minimalistbaker.com/wp-content/uploads/2014/10/SIMPLE-Pumpkin-Soup-with-Sesame-Kale-Topping-vegan-glutenfree.jpg",
      "calories":   149,
      "prepTime": "1 hr 15 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "2 sugar pumpkins",
        "2 medium shallots (diced)",
        "2 cups of vegetable broth",
        "2 tbsp of maple syrup or agave nectar (or honey if not vegan)",
        "¼ tsp of black pepper",
        "¼ tsp of nutmeg",
        "2 large cloves garlic (minced)",
        "1 tbsp of olive oil",
        "1 tbsp of olive oil (or sub water if oil-free)",
        "3 cloves garlic (minced)",
        "1 cup of canned light coconut milk (or sub other non-dairy milk)",
        "½ tsp of sea salt",
        "¼ tsp of cinnamon",
        "1 cup of roughly chopped kale",
        "2 tbsp of raw sesame seeds",
        "A pinch of salt"
    ]
    ,
      "instructions": [
        "step1: Preheat the oven to 350°F (176°C) and line a baking sheet with parchment paper.",
        "step2: Cut off the tops of the sugar pumpkins and halve them. Scrape out the seeds and strings.",
        "step3: Brush the flesh of the pumpkins with olive oil and place them face down on the baking sheet. Bake for 45-50 minutes or until a fork easily pierces the skin. Let cool for 10 minutes, then peel away the skin and set the pumpkin aside.",
        "step4: In a large saucepan over medium heat, add olive oil, shallots, and garlic. Cook for 2-3 minutes until slightly browned and translucent.",
        "step5: Add the remaining ingredients, including the pumpkin, and bring to a simmer.",
        "step6: Transfer the soup mixture to a blender or use an immersion blender to puree the soup. If using a blender, cover the lid with a towel to avoid accidents. Pour the mixture back into the pot.",
        "step7: Continue cooking over medium-low heat for 5-10 minutes, tasting and adjusting seasonings as needed. Serve as is or with the Kale-Sesame topping.",
        "step8: For the Kale-Sesame topping: In a small skillet over medium heat, dry toast sesame seeds for 2-3 minutes until slightly golden brown. Remove from the pan and set aside.",
        "step9: In the same hot pan, add olive oil and garlic, sautéing until golden brown (about 2 minutes). Add kale and toss, then add a pinch of sea salt and cover to steam. Cook until the kale is wilted, then add the sesame seeds back in and toss to coat.",
        "step10: Serve the soup topped with the kale-sesame mixture if desired."
    ]
    ,
      "nutritionInfo": {
        "protein": "2.7 g",
        "carbs": "23.5 g",
        "fat": "5.2 g",
        "fiber": "5 g"
      }
    },
    {
      "id": 27,
      "title": "Avocado Chickpea Tuna Salad",
      "image": "https://healthyfitnessmeals.com/wp-content/uploads/2022/08/Avocado-chickpea-tuna-salad-5.jpg",
      "calories":   567,
      "prepTime": "15 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "15 oz of tuna (canned in brine or olive oil)",
        "14 oz of chickpeas (drained)",
        "2 large avocados (peeled and pitted)",
        "2 large vine-ripened tomatoes (cut into wedges)",
        "1 large cucumber (halved lengthways and sliced)",
        "½ red onion (sliced thinly)",
        "¼ cup of olive oil",
        "2 tbsp of fresh lemon juice (squeezed)",
        "1 tbsp of fresh parsley (chopped, plus extra to serve)",
        "1 tsp of garlic (minced, or 1 large garlic clove, minced)",
        "¼ tsp of salt"
    ]
    ,
      "instructions": [
        "step1: Whisk together the dressing ingredients in a jug or jar.",
        "step2: In a large bowl, mix together all of the salad ingredients.",
        "step3: Toss the salad with the dressing. Season with pepper and extra salt if desired."
    ]
    ,
      "nutritionInfo": {
        "protein": "32g",
        "carbs": "42g",
        "fat": "32g",
        "fiber": "16g"
      }
    },
    {
      "id": 28,
      "title": "Aloo Tikki",
      "image": "https://www.cubesnjuliennes.com/wp-content/uploads/2020/08/Crispy-Aloo-Tikki-Recipe.jpg",
      "calories":    292,
      "prepTime": "40 mins",
      "servings": 4,
      "category": [],
      "ingredients": [
        "3 large potatoes, peeled, boiled, and mashed",
        "¾ cup of frozen peas (uncooked)",
        "¼ large onion, chopped",
        "1 jalapeno pepper, minced",
        "1 tsp of chili powder",
        "2 tsp of garam masala",
        "1 tsp of cumin powder",
        "1 tbsp of grated ginger",
        "Fresh parsley or cilantro leaves, chopped",
        "2 tbsp of bread crumbs (panko recommended)",
        "4 tbsp of flour",
        "Oil for frying"
    ]
    ,
      "instructions": [
        "step1: Once the potatoes have been boiled and mashed, add in all the other ingredients.",
        "step2: Form the mixture into patties (you should be able to get 8 large patties or 10 smaller ones).",
        "step3: Heat a little oil over medium-high heat and fry the patties for a few minutes on each side until golden brown.",
        "step4: Drain the cooked patties on paper towels to remove excess oil.",
        "step5: Serve with any sauce you like (a cottage/ricotta cheese mixture or chutney works well)."
    ]
    ,
      "nutritionInfo": {
        "protein": "8.6g",
        "carbs": "61.7g",
        "fat": "1.2g",
        "fiber": "9.5g"
      }
    },
    {
      "id": 29,
      "title": "Palak Paneer",
      "image": "https://www.recipetineats.com/tachyon/2021/02/Palak-Paneer_8.jpg?resize=900%2C1260&zoom=0.72",
      "calories":   510,
      "prepTime": "1hr 10 mins",
      "servings": 4,
      "category": [],
      "ingredients": [
        "1 homemade paneer",
        "2 tbsp of ghee or unsalted butter",
        "1 tsp of fenugreek seeds (whole)",
        "1 tsp of ground coriander",
        "½ tsp of black pepper",
        "½ tsp of ginger, finely grated",
        "1 green chili, finely diced (cayenne)",
        "½ cup of water",
        "1 tbsp of lemon juice",
        "2 tbsp of ghee or unsalted butter (for pan frying)",
        "1½ onion, finely chopped (brown or yellow)",
        "1 tsp of ground cumin",
        "½ tsp of kosher/cooking salt",
        "2 garlic cloves, finely chopped",
        "2 tomatoes, peeled, seeded, and diced",
        "700 g of fresh spinach leaves (English spinach), thoroughly washed and roughly chopped",
        "½ cup of cream (pure, heavy, or thickened)"
    ]
    ,
      "instructions": [
        "step1: Melt butter in a large pot over medium heat.",
        "step2: Add onion, fenugreek, cumin, coriander, salt, and pepper.",
        "step3: Cook for 3 minutes until the onion is softened but not golden.",
        "step4: Cook for 2 minutes until fragrant.",
        "step5: Cook for 3 minutes on medium heat.",
        "step6: Add about 1/3 of the spinach and stir until wilted.",
        "step7: Continue adding spinach in batches until all is wilted.",
        "step8: Stir occasionally while cooking for 10 minutes on medium heat.",
        "step9: Stir in the cream and lemon juice, cooking for an additional 3 minutes.",
        "step10: Remove half of the spinach mixture and blend to a puree using a stick blender.",
        "step11: Return the pureed spinach to the pot and stir to combine.",
        "step12: Gently stir in the golden pan-fried paneer and mix through.",
        "step13: Serve over basmati rice or with fluffy, chewy homemade naan."
    ]
    ,
      "nutritionInfo": {
        "protein": "16g",
        "carbs": "27g",
        "fat": "39g",
        "fiber": "4g"
      }
    },
    {
      "id": 30,
      "title": "Chicken Biryani",
      "image": "https://www.cubesnjuliennes.com/wp-content/uploads/2020/07/Chicken-Biryani-Recipe.jpg",
      "calories":    406.8,
      "prepTime": "1 hr 20 mins",
      "servings": 1,
      "category": [],
      "ingredients": [
        "750 g of chicken thighs, skin on, bone in, halved along the bone",
        "½ cup of plain yogurt",
        "¼ cup of water",
        "2 tbsp of vegetable oil (or other plain oil)",
        "4 garlic cloves, minced",
        "2 tsp of finely grated fresh ginger",
        "1 tsp of ground turmeric",
        "½ tsp of cinnamon",
        "½ tsp of cayenne (adjust spiciness to taste)",
        "½ tsp of ground cardamom",
        "2 tsp of garam masala",
        "2 tsp of coriander",
        "1 tbsp of cumin",
        "2 tbsp of paprika (sweet/delicate, not smoked)",
        "¾ tsp of salt",
        "2 tsp of salt (for boiling rice)",
        "10 cloves",
        "4 dried bay leaves",
        "1 star anise",
        "6 green cardamom pods",
        "2¼ cups of uncooked basmati rice",
        "2 medium onions (yellow or brown), halved and finely sliced",
        "1 cup of saffron threads (loosely packed)",
        "2 tbsp of warm water (for saffron)",
        "1 cup of coriander/cilantro, chopped",
        "¼ cup of ghee or unsalted butter, melted",
        "1 crispy onions (for garnish)",
        "1 chopped coriander/cilantro (for garnish)",
        "1 yogurt (for serving)"
    ]
    ,
      "instructions": [
        "step1: In a large pot, mix the marinade ingredients and coat the chicken well. Marinate for 20 minutes to overnight.",
        "step2: Bring 1 liter (1 quart) of water to a boil, add salt and spices. Add rice, bring back to a boil, and cook for 4 minutes until the rice is just cooked but still firm in the middle. Drain immediately and set aside.",
        "step3: Heat oil in a large saucepan over medium-high heat. Cook the onions in batches for 3 to 4 minutes until golden brown. Remove onto a paper towel-lined plate.",
        "step4: Place saffron in a bowl and leave for 10 minutes.",
        "step5: Place the pot with marinated chicken on medium heat. Cover and cook for 5 minutes. Remove the lid and cook for another 5 minutes, then reduce the heat to medium-low. Turn the chicken skin side down to cover the base of the pot. Scatter half the crispy onions and half the coriander over the chicken. Top with all the rice, gently patting it down to form the surface. Drizzle saffron water and melted butter over the rice.",
        "step6: Cover the pot with a lid and return to medium heat. Once steam is visible, reduce to low and cook for 25 minutes. Remove from heat and let it rest with the lid on for 10 minutes.",
        "step7: Serve the biryani by scooping from the pot to get a mix of rice and chicken. Garnish with remaining crispy onions and coriander, and serve with yogurt on the side."
    ]
    ,
      "nutritionInfo": {
        "protein": "20.6g",
        "carbs": "47.7g",
        "fat": "14.9g",
        "fiber": "2.9g"
      }
    }
  ]
  