{"week 2": {"Title1": {"titles": ["Highlights this week", "Baby development at 2 weeks"], "sections": [[{"subtitle": "Are you pregnant this week?", "content": ["You're not pregnant yet, but if youconceivethis week, you'll be two weeks pregnant. That's because healthcare providers use your lastmenstrual periodto determine yourdue date, so technically the first day of your period is also the first day of your pregnancy. Since you ovulate about two weeks into your cycle, conception happens around the time you're two weeks pregnant."]}, {"subtitle": "The best time to conceive", "content": ["You're most fertile during the three days leading up to ovulation.Signs you may be ovulatinginclude changes in your basal body temperature, breast tenderness, mild cramps, and increased vaginal discharge."]}, {"subtitle": "Detecting ovulation", "content": ["Toget pregnant faster, use ourOvulation Calculator, which can help you determine your most fertile days. You can also useovulation test stripsto figure out the days when sex (or insemination) is most likely to lead to pregnancy."]}], [{"subtitle": "Getting ready to grow a baby", "content": ["During the past few days, an increase in estrogen and progesterone prompted the lining of your uterus to thicken to support a fertilized egg. At the same time, in your ovaries, eggs have \"ripened\" in fluid-filled sacs called follicles."]}, {"subtitle": "An egg is released", "content": ["Once you ovulate, an egg erupts from its follicle and is swept from your ovary into a fallopian tube. Ovulation doesn't necessarily occur right in the middle of your cycle. For example, it could happen any time between days 9 and 21 for women with a 28-day cycle."]}]]}}, "week 3": {"Title1": {"titles": ["Highlights this week", "Baby development at 3 weeks"], "sections": [[{"subtitle": "The two-week wait", "content": ["If you're ready to be pregnant, the next weeks may feel like the longest of your life. You're in the so-calledtwo-week wait(TWW), the interval between when you may have conceived and when you can get a positivepregnancy test. Home pregnancy tests are only accurate on (or after) the first day of yourmissed period, so hold off on taking one just yet."]}, {"subtitle": "Implantation", "content": ["Your developing blastocyst has travelled down your fallopian tube to your uterus – and by the end of the week or the beginning of next, it mayimplant itselfin the lush uterine lining. (Before it implants, the blastocyst sheds its clear outer shell in a process called \"hatching\"!) You probably won't be aware all this is happening, though some women experience mildimplantation bleedingorimplantation cramping."]}, {"subtitle": "Early pregnancy symptoms", "content": ["Most women don't feel anything until they've missed a period, but you may notice bloating, cramping, or spotting this week. Your breasts may also be more tender than usual and you may have aheightened sense of smell, one of theearliest pregnancy symptoms. So if your partner, your house, or your dog suddenly smells different to you, thank your surging hormones."]}], [{"subtitle": "Cells are multiplying", "content": ["Your developing baby is a tiny ball of several hundred cells that are multiplying and burrowing into the lining of your uterus. The cells in the middle will become the embryo. The cells on the outside will become theplacenta, the pancake-shaped organ that delivers oxygen and nutrients to your baby and carries away waste."]}, {"subtitle": "Connecting to you", "content": ["Your baby-to-be is receiving oxygen and nutrients (and discarding waste) through a primitive circulation system made up of microscopic tunnels that connect to the blood vessels in your uterine wall. The placenta will eventually take over this task around the end of thefirst trimester."]}]]}}, "week 4": {"Title1": {"titles": ["Highlights this week", "Baby development at 4 weeks"], "sections": [[{"subtitle": "Taking a pregnancy test", "content": ["By the end of this week, you may be able to get a positivepregnancy test. Pregnancy tests work by detecting the presence of a hormone called human chorionic gonadotropin (hCG) in your urine. Some home pregnancy tests claim to detect pregnancy as early as five days before you miss your period, but it's best to wait until the first day of your missed period for accurate results. If you test too soon, you may get afalse negative pregnancy testor an unclear result like afaint line."]}, {"subtitle": "Your due date", "content": ["OurDue Date Calculatorcan determine your due date based on the date of your last menstrual period or the date of conception. Keep in mind that a due date is just a guess – only 1 out of 20 women actually delivers on her due date. You're just as likely to go intolaborany day during the two weeks before or after."]}, {"subtitle": "From blastocyst to embryo", "content": ["Your baby-to-be will soon transform from a ball of cells called a blastocyst to an embryo the size of a poppy seed. (Once your amniotic sac forms, 10 to 12 days after fertilization, your baby becomes an official embryo.) Over the next six weeks, your baby's nervous system, connective tissue, and organs will start to develop."]}], [{"subtitle": "Growing fast", "content": ["Now that your little embryo hasimplantedin your uterus, cells are multiplying rapidly and taking on different functions. Your baby-to-be consists of two layers (called the hypoblast and the epiblast) from which all of the organs will begin to develop over the next six weeks.", "This is the time when your baby will be most vulnerable to anything that might interfere with development, so be sure to steer clear of alcohol, smoking, drugs, andunsafe chemicals.", "Also, watch out for overheating. High temperatures, especially early in pregnancy, have been associated with increased risk ofneural tube defects. That's why saunas, steam baths, andhot tubsaren't recommended during pregnancy."]}, {"subtitle": "Primitive placenta", "content": ["Your embryo's outer cells are tunneling into the lining of your uterus. Spaces form within this layer for your blood to flow into so that you'll be able to provide nutrients and oxygen to your growing baby."]}, {"subtitle": "Amniotic sac and yolk sac", "content": ["There's now an amniotic sac surrounding your embryo – it contains amniotic fluid and will cushion your baby as they grow. Your tiny embryo also has a yolk sac, which temporarily provides nourishment and makes cells that turn into the umbilical cord, gastrointestinal system, and reproductive organs."]}, {"subtitle": "Having twins?", "content": ["It's too soon to know. But it's still fun to seewhat fraternal twins look likein the womb this week. You can also learn about yourlikelihood of having twinsor more."]}]]}}, "week 5": {"Title1": {"titles": ["Highlights this week", "Baby development at 5 weeks"], "sections": [[{"subtitle": "Feeling pregnant?", "content": ["You may be growing more aware ofearly pregnancy symptoms, includingfatigue, achy or swollenbreasts,nausea, and theneed to peemore often."]}, {"subtitle": "Announcing your pregnancy", "content": ["There are no hard and fast rules about when toannounce your pregnancy. Many expecting parents wait until late in the first trimester, but it's up to you."]}, {"subtitle": "Having twins", "content": ["The likelihood oftwinsis about 3 out of 100 for most people, but chances are as high as 30% if you had certainfertility treatments. Women typically discover they're having more than one baby during anultrasoundin the first trimester."]}], [{"subtitle": "Tiny embryo", "content": ["Deep in your uterus an embryo is growing at a furious pace, and it looks more like a tadpole than a human. The embryo is made up of three layers – the ectoderm, the mesoderm, and the endoderm – which will later form all of the organs and tissues."]}, {"subtitle": "Brain development", "content": ["Your baby'sbrain, spinal cord, and nerves form from the neural tube, which is starting to develop from the embryo's top layer – the ectoderm. This layer will also give rise to skin, hair, nails, mammary and sweat glands, and tooth enamel."]}, {"subtitle": "Heart development", "content": ["Theheartand circulatory system begin to form in the embryo's middle layer, or mesoderm. The mesoderm will also form your baby's muscles, cartilage, bone, and the tissue under the skin."]}, {"subtitle": "Lungs and gut", "content": ["The third layer, or endoderm, will become thelungs, intestines, and earlyurinary system, as well as the thyroid, liver, and pancreas. In the meantime, the primitiveplacentaandumbilical cord, which deliver nourishment and oxygen to your baby, are already on the job."]}]]}}, "week 6": {"Title1": {"titles": ["Highlights this week", "Baby development at 6 weeks"], "sections": [[{"subtitle": "Hearing your baby's heartbeat", "content": ["Your baby's heart isn't fully developed, but cells in the heart tube have startedbeatingfast, around 160 times a minute. You may hear the sound this week if you have an early ultrasound."]}, {"subtitle": "Morning sickness relief", "content": ["It's counterintuitive, but eating small meals throughout the day can help you keep nausea at bay. Snacking on bland foods, drinking ginger tea, and taking certain medications can alsorelieve morning sickness."]}, {"subtitle": "Is bleeding normal?", "content": ["One in four women have somebleedingduring this trimester. If you do, call your healthcare provider and get it checked out. Spotting or light bleeding is probably from something minor, but it could also be a sign of a serious problem, such as an ectopic pregnancy, a miscarriage, or problems with the placenta."]}], [{"subtitle": "Heartbeat", "content": ["There's cardiac activity in your baby'sdeveloping heart. You'll see the cells flickering if you have a vaginal ultrasound in the next few weeks. Starting at 10 to 12 weeks, your provider will listen to your baby's heartbeat at every prenatal appointment using a handheld Doppler."]}, {"subtitle": "Eyes, nose, mouth, and ears", "content": ["There are dark spots whereyour baby's eyesand nostrils are starting to form. Emergingearsare marked by small depressions on the sides of the head. Inside their tiny mouth, the tongue and vocal cords are beginning to develop."]}, {"subtitle": "Arms and legs", "content": ["Your baby'sarms and legsbegin as tiny paddles that will lengthen and grow into limbs. The backbone extends into a small tail that will disappear within a few weeks.", "You can track these developments and your baby's growth during pregnancy with thefree BabyCenter appOpens a new window."]}]]}}, "week 7": {"Title1": {"titles": ["Highlights this week", "Baby development at 7 weeks"], "sections": [[{"subtitle": "Your baby takes shape", "content": ["Your baby's little features – eyes, nose, mouth, and ears – are starting to look more defined.Arm and leg budsare growing longer."]}, {"subtitle": "Testing decisions", "content": ["First trimesterprenatal testing optionsinclude theNIPTblood test, the NT ultrasound, and CVS. If you’re having trouble deciding which tests are right for you, talk to your healthcare provider and other people you trust."]}, {"subtitle": "Foods to skip", "content": ["Somefoods to avoid now: Swordfish, cold deli meats, raw oysters, homemade cookie dough, bean sprouts, extra-large coffees, unpasteurized juices, and queso fresco."]}], [{"subtitle": "Your baby's eyes", "content": ["The main parts of theeyethat allow your baby to see – the cornea, iris, pupil, lens, and retina – start developing this week, and they're almost fully formed just a few weeks later."]}, {"subtitle": "Your baby's digestive system", "content": ["Your baby's stomachand esophagus start to form. The esophagus is the tube that moves food from your baby's mouth to the stomach.", "Your baby's liver and pancreas are also starting to develop this week."]}, {"subtitle": "Brain development", "content": ["The neural tube that becomes your baby's spinal column and brain has formed and closed on both ends, with your baby's brain at the top. It's now made up of three areas (forebrain, midbrain, and hindbrain). Amazingly,your baby's braingains 250,000 cells per minute, on average, throughout the course of pregnancy."]}]]}}, "week 8": {"Title1": {"titles": ["Highlights this week", "Baby development at 8 weeks"], "sections": [[{"subtitle": "Your baby's fingers and toes", "content": ["Your baby's hands and feet – which look like paddles – are sproutingwebbed fingers and toes. Nerves, bones, and muscles are developing inside your baby's tiny limbs."]}, {"subtitle": "Breast changes", "content": ["Your breasts may be tender and swollen by now. If your old bras are feeling tight, buy a few goodmaternity brasfor support."]}, {"subtitle": "Pregnancy and work", "content": ["If you work with other expecting moms or people with young children, you may want to ask for their support and advice on beingpregnant at work."]}, {"subtitle": "Your baby registry", "content": ["It's not too soon to check outRegistry Builder, which finds the best baby registries for you and helps you manage them in one place."]}], [{"subtitle": "Baby movements", "content": ["Your baby is moving! These first movements are more like spontaneous twitches and stretches. They start at about 7 to 8 weeks and are visible on ultrasound. You won'tfeel your baby moveuntil sometime between 16 and 22 weeks, though. Until then, your baby's movements aren't strong enough for you to notice."]}, {"subtitle": "Getting ready to breathe", "content": ["Your baby's respiratory system is forming. Breathing tubes extend from your baby's throat to the branches of theirdeveloping lungs."]}, {"subtitle": "Nerve network", "content": ["A network ofnervesis spreading through your baby's body, making connections not only with each other but also with muscles and other tissues, as well as organs like the eyes and ears."]}, {"subtitle": "Having twins?", "content": ["Learn more about being8 weeks pregnant with twins."]}]]}}, "week 9": {"Title1": {"titles": ["Highlights this week", "Baby development at 9 weeks"], "sections": [[{"subtitle": "Your baby's body", "content": ["Your baby has all the essential body parts now, including elbows and knees. On your baby's face, the upper lip, nose, and eyelids have formed. And your baby's tiny toes are visible!"]}, {"subtitle": "Warning signs of a pregnancy complication", "content": ["Lower back pain, vaginal bleeding or spotting, and persistent itching are among thepregnancy symptoms you shouldn't ignore. Always reach out to your doctor or midwife when you have a concern – that's what they're there for."]}, {"subtitle": "Feeling exhausted?", "content": ["Not only does it take a lot of energy to make a baby, but pregnancy brings all sorts ofsleep disturbances, including nausea, heartburn, and a frequent need to pee. Try to nap when you can, and consider investing in agood pregnancy pillowif you're having trouble getting comfy in bed."]}], [{"subtitle": "Teeth are budding", "content": ["Ten tinytooth buds are developingwithin each band of gums. (They'll transform into the 20 \"baby teeth\" that eventually fall out during childhood.) Next week, the teeth start to harden and connect to your baby's jaw. You'll see these pearly whites start to poke out when your baby gets afirst tooth, usually between 4 and 7 months old. Some babies are born with a tooth, but this is rare."]}, {"subtitle": "Your baby's heart", "content": ["The four chambers ofyour baby's hearthave formed. If you expect to hear the familiar, steady \"lub-dub\" sound of a human heartbeat at a prenatal appointment, you're in for a surprise. Many people describe the sound of theirbaby's heartbeatas similar to the thunder of galloping horses. That's because your baby's heart beats about twice as fast as yours does."]}, {"subtitle": "The placenta takes over", "content": ["Your body is not only growing a new baby, but also a new organ – the placenta, which is attached to your uterus and connected to your baby through theumbilical cord. Yourplacentais developed enough now to take over most of the critical job of producing hormones that help your baby grow and develop. By the end of your pregnancy, it will be about 9 inches in diameter and an inch thick, not unlike a large pancake. Some moms choose toeat the placentaafter birth, though the benefits of this haven't been proven."]}]]}}, "week 10": {"Title1": {"titles": ["Highlights this week", "Baby development at 10 weeks"], "sections": [[{"subtitle": "Hearing the heartbeat", "content": ["You may hear yourbaby's heartbeaton a fetal Doppler during your next prenatal visit. It's much faster than an adult heartbeat – it sounds like galloping horses. You may want to take your phone out and record it."]}, {"subtitle": "NIPT test", "content": ["You can take theNIPT blood test(short for noninvasive prenatal testing) this week. It screens for Down syndrome and a few other conditions, and can tell you whether you're having a boy or a girl. Be sure to tell your provider if you'd rather not find out!"]}, {"subtitle": "First ultrasound", "content": ["More and more doctors are doingultrasoundsfor their patients during thefirst trimester– as early as 6 to 10 weeks. Your provider may want you to have an early ultrasound if you've had a previous pregnancy complication, such as amiscarriageorectopic pregnancy. At this early point in pregnancy, you'll probably have a transvaginal ultrasound."]}], [{"subtitle": "Your baby's eyes", "content": ["The main parts of the eye that enable yourbaby's vision– the cornea, iris, pupil, lens, and retina – are fully formed.Eyelidscover your baby's eyes, and they'll stay shut until you're 27 weeks pregnant."]}, {"subtitle": "Your baby has teeth!", "content": ["Your baby'steethare starting to harden and connect to the jaw bone. A few babies are born with a tooth or two, but most don'tsprout a first toothuntil 6 to 10 months old."]}, {"subtitle": "Early brain development", "content": ["Your baby's forehead temporarily bulges with theirdeveloping brainand sits very high on their head, which measures half the length of their body. Synapses in your baby's spinal cord allow them to move their limbs and fingers."]}]]}}, "week 11": {"Title1": {"titles": ["Highlights this week", "Baby development at 11 weeks"], "sections": [[{"subtitle": "When you'll feel kicks", "content": ["Your baby is busy somersaulting and stretching, but they're still too small for you to notice it. You probably won'tfeel your baby moveuntil you're at least 16 weeks pregnant."]}, {"subtitle": "If you're starting to show", "content": ["Create a time-lapse record of your pregnancy bydocumenting your growing bumpevery week. You can take selfies or ask your partner or a friend to take photos."]}, {"subtitle": "Sharing your news", "content": ["If you haven't spilled the beans yet, start thinking about how you'll let family and friends know you're expecting.Pregnancy announcementsrange from a group text message to an elaborately staged photo or big reveal."]}], [{"subtitle": "Your baby's fingers and toes", "content": ["Your baby's tiny fingers and toes have lost their webbing and are distinct – and longer."]}, {"subtitle": "Organs are working", "content": ["As you reach the end of thefirst trimester, all your baby's vital organs are in place, and many have already started to function. The liver is making red blood cells, kidneys are making urine, and the pancreas starts making insulin. The four chambers of your baby's heart are fully formed, and yourbaby's heart is beating."]}, {"subtitle": "Genitals are forming", "content": ["By the end of this week,your baby's genitalswill start developing. The external sex organs – the penis and scrotum in boys, the clitoris and labia in girls – don't start to differ from each other until about 11 weeks. And even then, it takes several more weeks to be able to easily see the difference between boys and girls on an ultrasound."]}]]}}, "week 12": {"Title1": {"titles": ["Highlights this week", "Baby development at 12 weeks"], "sections": [[{"subtitle": "Your growing uterus", "content": ["Your uterus has grown to the size of a grapefruit! Your healthcare provider can now feel the top of it (the fundus) low in your abdomen, above your pubic bone."]}, {"subtitle": "Miscarriage rate drops", "content": ["If you've been worried aboutmiscarriage(like many expecting parents), here's some happy news: The risk drops significantly as your pregnancy progresses. Once you've had a first prenatal visit and seen or heard yourbaby's heartbeat, the chance of miscarriage is very low."]}, {"subtitle": "Your baby is fully formed", "content": ["All of your baby's vital organs and body parts are in place. They'll continue to develop throughout your pregnancy."]}], [{"subtitle": "Small movements", "content": ["This week, your baby can open and close their hands (making a fist) and curl their toes."]}, {"subtitle": "Tiny fingernails", "content": ["Your baby has itsy bitsy nails growing on theirfingers and toes."]}, {"subtitle": "Your baby's intestines", "content": ["The stomach and esophagus started forming around 7 weeks of pregnancy, andyour baby's intestinesgrew so fast that they protruded into the umbilical cord. Soon, the abdominal wall will close and their intestines will make their way inside their abdomen."]}, {"subtitle": "Having twins?", "content": ["Learn more about being12 weeks pregnant with twins."]}]]}}, "week 13": {"Title1": {"titles": ["Highlights this week", "Baby development at 13 weeks"], "sections": [[{"subtitle": "Fading first-trimester symptoms", "content": ["As you cruise into thesecond trimester, you may get some relief fromearly pregnancy symptomssuch astender breasts,fatigue,food aversions,morning sickness, and theconstant need to pee."]}, {"subtitle": "Breastfeeding prep", "content": ["You can't feel it, but your breasts may have already started makingcolostrum, the nutrient-rich fluid that feeds your baby for the first few days after birth, before your milk starts to flow. Later in pregnancy, your breasts may leak a little colostrum."]}, {"subtitle": "Making a baby registry", "content": ["OurRegistry Builderwill help you keep all your baby registries organized, and there's only one link to send friends and family."]}], [{"subtitle": "Your baby can pee!", "content": ["Your baby has startedswallowing amniotic fluidand excreting urine, recycling the full volume of fluid every few hours."]}, {"subtitle": "Making meconium", "content": ["As your baby swallows amniotic fluid, they also produce meconium. This black, sticky substance accumulates in the bowels, and becomes your newborn's first poop."]}, {"subtitle": "Teeth and bones", "content": ["Bones are beginning to harden in your baby's skeleton, especially longer bones and the skull. Your baby's teeth and bones are becoming denser."]}]]}}, "week 14": {"Title1": {"titles": ["Highlights this week", "Baby development at 14 weeks"], "sections": [[{"subtitle": "Welcome to your second trimester!", "content": ["This is many moms' favorite part of pregnancy. You'llfeel your baby move, see them on anultrasound, and get a break from some unpleasant early and latepregnancy symptoms."]}, {"subtitle": "Maternity photo shoot ideas", "content": ["If you're thinking of taking special maternity photos, here are tips on when, where, and how to get the bestpregnancy pictures."]}, {"subtitle": "Gaining weight?", "content": ["Check out our medically reviewed chart to find your targetpregnancy weight gaindepending on your pre-pregnancy weight and whether you're carrying one child or twins."]}], [{"subtitle": "Making faces", "content": ["Thanks to brain impulses, your baby's facial muscles are getting a workout. Those tiny features can squint, frown, and grimace. Your baby is also making sucking and chewing movements."]}, {"subtitle": "Growing hair", "content": ["Softbaby hairis coming: Hair follicles have started to form deep in your baby's skin. Around 20 weeks, fine downy hair will sprout from these follicles on your baby's eyebrows, upper lip, and chin."]}, {"subtitle": "Your active baby", "content": ["Though you can't feel those tiny punches and kicks yet, your baby is quite active and has flexible hands and feet."]}, {"subtitle": "They grow so fast!", "content": ["You may wonder why this week'sfetal length measurement(below) is so much bigger than last week's. Your baby hasn't doubled in length in a week – there's just a change in how they're measured at 14 weeks (from head to bottom to head to toe)."]}]]}}, "week 15": {"Title1": {"titles": ["Highlights this week", "Baby development at 15 weeks"], "sections": [[{"subtitle": "Baby gender predictor", "content": ["If you have anultrasoundcoming up, you may be able tofind out your baby's sexif you don't know already. Just for fun, you can also try thesebaby gender predictor tests. They're highly unscientific – but they still have a 50/50 chance of being right."]}, {"subtitle": "Sex during pregnancy", "content": ["In most cases, you can continue to havesex during pregnancyright up until your water breaks or you go into labor. You may find that in the second trimester, your sex drive comes back full force. And thanks to increased blood flow and lubrication, sex may feel better than ever."]}, {"subtitle": "Having an amnio?", "content": ["Amniocentesiscan tell you whether your baby has genetic or chromosomal abnormalities. It's usually done between 15 and 20 weeks of pregnancy, so if you want to have one, talk to your healthcare provider to get it scheduled."]}], [{"subtitle": "Sense of taste", "content": ["Your baby is formingtaste buds,and nerves begin connecting them to the brain. By about 20 weeks, your baby's taste buds will be fully formed. During pregnancy, molecules of what you eat pass through your bloodstream and make it into your amniotic fluid. But your baby doesn't actually taste what you're eating – so don't worry that they won't enjoy what you're having for dinner."]}, {"subtitle": "Baby movement", "content": ["Your baby's legs are growing longer than their arms now, and they can move all of theirjoints and limbs. Your active baby is moving constantly, though you can't feel it yet."]}, {"subtitle": "Your baby's face", "content": ["Your baby is looking more like a little person, with eyelids, eyebrows, eyelashes, nails, hair, and well-defined fingers and toes. If you could see inside your womb, you'd catch your baby sucking a thumb, yawning, stretching, and making faces."]}]]}}, "week 16": {"Title1": {"titles": ["Highlights this week", "Baby development at 16 weeks"], "sections": [[{"subtitle": "Baby kicks coming soon", "content": ["You'll probably startfeeling your baby movebetween 16 and 22 weeks, most likely when you're sitting or lying quietly. Veteran moms usually notice the first subtle flutters, known as \"quickening,\" earlier than first-time moms."]}, {"subtitle": "Pregnancy glow", "content": ["Glowing skin during pregnancy isn't a myth – it's a real thing that happens thanks to fluctuating hormone levels and increased blood flow. You're most likely to have apregnancy glowin the second trimester."]}, {"subtitle": "Dreaming of a babymoon?", "content": ["If you're planning to take one last trip before you add to your family, check out these tips on having a fantasticbabymoon."]}], [{"subtitle": "Delicate baby skin", "content": ["Your baby's skin is thin and translucent. It will thicken and develop as your pregnancy progresses, but will continue to be almost transparent for quite some time."]}, {"subtitle": "Scalp patterning", "content": ["On your baby's scalp, hair follicles are forming a pattern that will remain for life. This patterning sets the stage for howyour baby's hairwill grow. New hair follicles don't form after birth, so babies are born with all the hair follicles they'll ever have."]}, {"subtitle": "Heart at work", "content": ["Your baby's heartis now pumping about 25 quarts of blood each day, and this amount will continue to increase as your little one develops."]}, {"subtitle": "Having twins?", "content": ["Learn more about being16 weeks pregnant with twins."]}]]}}, "week 17": {"Title1": {"titles": ["Highlights this week", "Baby development at 17 weeks"], "sections": [[{"subtitle": "Your baby can hear you", "content": ["Between 16 and 22 weeks, yourbaby will start to hearsounds inside your body, including the noises made by your heartbeat, breathing, and digestion."]}, {"subtitle": "Better sleep", "content": ["Resting easier in the second trimester? Enjoy it – and switch tosleeping on your sidesoon if you haven't already. Side sleeping places the least pressure on your veins and internal organs, ensuring the best blood flow to the uterus. That means your baby will get maximumnutrientsand oxygen."]}, {"subtitle": "Maternity pictures", "content": ["Make sure to capture photos of your beautiful pregnant self. Whether you have a professional photographer, a friend, or your partner take photos, here are some greatmaternity picture ideas."]}], [{"subtitle": "Your baby's bones", "content": ["Your baby's skeleton is changing from soft cartilage to bone. Support your baby's bone health (and your own) by eatingcalcium-rich foods. Getting enough calcium also reduces your risk ofhypertensionandpreeclampsia."]}, {"subtitle": "The umbilical cord", "content": ["Theumbilical cord– your baby's lifeline to theplacenta– is growing stronger and thicker. By the end of pregnancy, it will be approximately 9 inches long and an inch thick. The umbilical cord delivers nutrients to your baby and ferries away waste products."]}, {"subtitle": "Your baby's skin", "content": ["Sweat glands are starting to develop. And by next week, the layers ofyour baby's skinwill be fully formed."]}]]}}, "week 18": {"Title1": {"titles": ["Highlights this week", "Baby development at 18 weeks"], "sections": [[{"subtitle": "Mid-pregnancy ultrasound", "content": ["Get ready to see your baby! You'll have anultrasoundbetween 18 and 22 weeks to check on your baby's health and development. It usually lasts 20 to 45 minutes."]}, {"subtitle": "Baby kicks", "content": ["Are youfeeling your baby move? If not, it may happen soon. The first movements often feel like little flutters, gas bubbles, or even like popcorn popping. They'll grow stronger and more frequent over time."]}, {"subtitle": "Great pregnancy snacks", "content": ["In your second trimester, experts recommend getting about 340 extra calories a day. Eatinghealthy snacksbetween meals will help you meet this goal and keep your blood sugar level so you don't get too hungry."]}], [{"subtitle": "Your baby's face", "content": ["Your baby'sears, nose, and lips are all recognizable on an ultrasound. Eyelids, eyebrows, eyelashes, nails, and hair are formed, too!"]}, {"subtitle": "Lungs branching out", "content": ["In your baby'slungs, the smallest tubes (bronchioles) start to develop. At the end of these tiny tubes, respiratory sacs begin to appear. By the time your baby is born, these sacs will become enmeshed with tiny blood vessels that allow oxygen and carbon dioxide to flow in and out."]}, {"subtitle": "Girl and boy parts", "content": ["If you're having a girl, her uterus and fallopian tubes are formed and in place. If you're having a boy,his genitalsare visible now."]}]]}}, "week 19": {"Title1": {"titles": ["Highlights this week", "Baby development at 19 weeks"], "sections": [[{"subtitle": "Rainbow babies", "content": ["If you're pregnant after a loss, you may struggle with mixed emotions like worry, excitement, fear, and joy. Here are ways to honor your experience and celebrate yourrainbow baby."]}, {"subtitle": "Baby shower planning", "content": ["Having ababy showerorbaby sprinkle? It's not too early to talk to the host about the theme and whom to invite."]}, {"subtitle": "Baby name ideas", "content": ["For inspiration, check out these baby names inspired bynature,outer space, andlove."]}], [{"subtitle": "Fingerprints", "content": ["The skin on your baby'sfingers and toeshas formed distinct patterns. These fingerprints (and toeprints) are now permanent and unique – even among identical twins!"]}, {"subtitle": "Your baby's senses", "content": ["Your baby's sensory development is exploding. Theirbrainis designating specialized areas for smell, taste, hearing, vision, and touch."]}, {"subtitle": "Vernix caseosa", "content": ["A white, waxy coating calledvernix caseosais forming on your baby's skin. Vernix has many benefits: It protects and moisturizes your baby's skin, protects against harmful bacteria, and helps the lungs and digestive tract develop."]}]]}}, "week 20": {"Title1": {"titles": ["Highlights this week", "Baby development at 20 weeks"], "sections": [[{"subtitle": "You're halfway there!", "content": ["You're at the midpoint in your pregnancy – or maybe a little more or less. Most women don't deliver exactly on theirdue date. You're just as likely to go into labor any day during the two weeks before or after."]}, {"subtitle": "Fundal height", "content": ["From now on, at each prenatal visit your doctor or midwife will measure your belly from your pubic bone to the top of your uterus. This \"fundal height\" measurement shows how your baby's growing. Starting around 24 weeks, the height in centimeters is about equal to the number of weeks you're pregnant."]}, {"subtitle": "Baby registries", "content": ["Ready to create your baby registries? OurRegistry Builderwill make the process as stress-free as possible."]}], [{"subtitle": "Baby hiccups", "content": ["If you notice some baby movements that feel like subtle, rhythmic jerking, don't worry –baby hiccups in the wombare totally normal. Many expecting moms start to feel baby hiccups around the same time they feel other fetal movements, typically between 16 and 22 weeks."]}, {"subtitle": "Your baby can taste", "content": ["Many of yourbaby's taste budscan now transmit taste signals to their brain, and your baby is swallowing molecules of the food you eat that have passed through your blood into your amniotic fluid. Researchers aren't positive whether babies can taste these molecules, but some research indicates that what you eat during pregnancy can influence the foods your baby prefers later."]}, {"subtitle": "Having twins?", "content": ["Learn more about being20 weeks pregnant with twins."]}]]}}, "week 21": {"Title1": {"titles": ["Highlights this week", "Baby development at 21 weeks"], "sections": [[{"subtitle": "Baby kicks", "content": ["Soon, other people may be able tofeel your baby moveby putting a hand on your belly. Your baby's initial fluttering movements will turn into full-fledged kicks and nudges."]}, {"subtitle": "Hiring a doula", "content": ["Adoulais a trained labor and birth assistant who can support you during your baby's birth. If you're looking for a doula, start interviewing candidates soon."]}, {"subtitle": "Swimming during pregnancy", "content": ["Swimmingis one of the best exercises for expecting moms. It's low-impact and gentle on your body, and can help easepregnancy aches and pains. As your belly gets bigger, it's extra nice to float, weightless, in the water."]}], [{"subtitle": "Your baby's taste buds", "content": ["Your baby has workingtaste budsand can taste what you eat when they swallow your amniotic fluid."]}, {"subtitle": "Sucking reflex", "content": ["Your baby'ssucking reflexis starting to develop, and your baby can suck their thumb. (You may have seen this on anultrasound!)"]}, {"subtitle": "Your baby's skin", "content": ["Smooth, gorgeous skin is in your baby's future – but for now, their skin is wrinkled and translucent. It appears red because of visible blood vessels."]}]]}}, "week 22": {"Title1": {"titles": ["Highlights this week", "Baby development at 22 weeks"], "sections": [[{"subtitle": "Positive affirmations", "content": ["The right words can help you through even the most challenging moments. Try some of these encouragingaffirmations for pregnancyand parenting."]}, {"subtitle": "Pets and pregnancy", "content": ["Is your dog extra protective? Is your cat curling up on your belly? Many animal experts and pet lovers agree thatpets can sense pregnancy(or at least pregnancy-related changes)."]}, {"subtitle": "Plus-size pregnancy", "content": ["You can have a healthyplus-size pregnancy. Being overweight or obese raises your risk for some complications, but many of these are manageable – and in some cases preventable."]}], [{"subtitle": "Your baby's hair", "content": ["Baby hairis visible on your little one's head. It's thin now, but may be thick and lustrous by the end of pregnancy. Your baby has eyebrows now, as well as lanugo (soft, fine body hair) on their back, ears, shoulders, and forehead."]}, {"subtitle": "Hearing your heartbeat", "content": ["Your baby may be able tohear soundsfrom inside your body, such as noises from your breathing, heartbeat, and digestion. These sounds will grow louder as your baby's hearing improves. And once your little one is born, they may sleep better with asound machinethat makes whooshing and thumping sounds similar to the ones they're used to hearing."]}, {"subtitle": "Baby fat", "content": ["A layer of fat is forming under your baby's skin. Someday you'll kiss your little one's chubby rolls, but for now, your baby's body is still very skinny."]}]]}}, "week 23": {"Title1": {"titles": ["Highlights this week", "Baby development at 23 weeks"], "sections": [[{"subtitle": "Safe pregnancy exercise", "content": ["For most expecting moms, exercise is not only safe, it's recommended for a healthy pregnancy. Choose from thesesafe pregnancy workouts."]}, {"subtitle": "Top pregnancy foods", "content": ["Salmon helps with fetal brain development. Eggs help prevent certain birth defects. Avocados can ward off leg cramps. And that's only the beginning! Here are thebest foods for pregnancy."]}, {"subtitle": "Baby name inspiration", "content": ["Has the baby-naming game left you stumped? If you're fresh out of ideas, try ourBaby Names Finder."]}], [{"subtitle": "Hearing you", "content": ["Your baby canhear soundsfrom outside your body now, such as your voice or your partner's. Research shows babies learn to recognize their mother's voice inside the womb, and show a clear preference for her voice over others."]}, {"subtitle": "Your baby's digestive system", "content": ["The wave-like movements that propel food along your baby'sdigestive tractbegin now. As with swallowing, it's just practice for your baby's system at this point since there's no actual food to move."]}, {"subtitle": "Baby movement", "content": ["Those subtle flutters you've noticed may begin to feel stronger. Instead of something like butterfly wings,baby movementswill evolve into gentle kicks and jabs. At 23 weeks, you can begin making note of patterns associated with your baby's movement. Are they more active after you eat? Do they get a little wild when you lie down for the night?"]}]]}}, "week 24": {"Title1": {"titles": ["Highlights this week", "Baby development at 24 weeks"], "sections": [[{"subtitle": "Pregnancy glow", "content": ["Thepregnancy glowyou've likely heard so much about isn't a myth. Changing hormones, above-average oil production, and increased blood flow can make your skin look flushed, shiny, and even radiant."]}, {"subtitle": "Unusual baby names", "content": ["If you're not jazzed about themost popular baby names, check out theseuncommon and unusual baby names– Golden, Zen, Ajax, Booker, and more."]}, {"subtitle": "Nesting", "content": ["Feeling a strong urge to clean and organize your home? You're probablynesting. Preparing your \"nest\" for a new baby is an instinct common in humans and animals."]}], [{"subtitle": "Your baby's lungs", "content": ["Respiratory sacs at the tips of the smallest branches ofyour baby's lungsare growing and multiplying, adding more surface area for the exchange of oxygen and carbon dioxide."]}, {"subtitle": "Gaining weight", "content": ["Your baby cuts a pretty lean figure at this point, but their body is filling out proportionally, and soon they'll start to plump up. Their skin is still thin and translucent."]}, {"subtitle": "Raising an eyebrow", "content": ["Tinyeyebrows grewon your baby's face just a few weeks ago. Now your baby may practice working their facial muscles and raising them."]}, {"subtitle": "Having twins?", "content": ["Learn more about being24 weeks pregnant with twins."]}]]}}, "week 25": {"Title1": {"titles": ["Highlights this week", "Baby development at 25 weeks"], "sections": [[{"subtitle": "Safe pregnancy exercise", "content": ["Most women can keep exercising throughout pregnancy – and exercise has lots of benefits. But as your body changes, you'll need tomodify your workouts."]}, {"subtitle": "Belly button popping out?", "content": ["Is your innie looking more like an outie now that you're creeping up on your third trimester? Don't worry: Usuallypregnancy belly buttonchanges are temporary."]}, {"subtitle": "Staying hydrated", "content": ["You've probably heard it a thousand times by now, but it's true –staying hydratedduring pregnancy is important. Try to drink about 10 glasses of water a day."]}], [{"subtitle": "Gaining baby fat", "content": ["Your baby will soon exchange that long, lean look for some baby fat. Wrinkled skin will begin to smooth out, and they'll start to look more and more like anewborn."]}, {"subtitle": "Your baby's hair", "content": ["Your baby isgrowing more hair– and if you could see it, you'd be able to discern its color and texture."]}, {"subtitle": "Sleeping like a baby", "content": ["Your baby spends most of their time sleeping, and cycles between rapid eye movement (REM) sleep and non-REM sleep every 20 to 40 minutes."]}]]}}, "week 26": {"Title1": {"titles": ["Highlights this week", "Baby development at 26 weeks"], "sections": [[{"subtitle": "Maternity picture ideas", "content": ["With your third trimester just around the corner, your baby bump may be looking especially photo-ready. Capture this special point in pregnancy with thesematernity pictureideas."]}, {"subtitle": "3D ultrasound", "content": ["A \"keepsake ultrasound\" from a private clinic can give you a magical view of your baby, but many experts recommend against them. Here are a few things worth considering before you book a3D ultrasound."]}, {"subtitle": "Pregnancy nutrition", "content": ["It's essential to get enough of key nutrients like calcium, iron, iodine, choline, vitamin A, vitamin C, vitamin D, vitamin B6, vitamin B12, folic acid, and omega-3 fatty acids. Learn more about thepregnancy nutrientsyou need now."]}], [{"subtitle": "Your baby's lungs", "content": ["Your baby has started toinhale and exhalesmall amounts of amniotic fluid, which is essential for lung development."]}, {"subtitle": "Responding to sounds", "content": ["Your baby canhear your voiceand may even respond to it with changes in their heartbeat, breathing, and movement. If a noise is particularly loud, your baby may startle – and you mightfeel your baby move.Ultrasoundshave also caught changes in babies' facial expressions when they hear music."]}, {"subtitle": "Testicles dropping", "content": ["If you're having a boy, his testicles have begun to descend into his scrotum – a trip that will take about two to three months."]}]]}}, "week 27": {"Title1": {"titles": ["Highlights this week", "Baby development at 27 weeks"], "sections": [[{"subtitle": "Taking naps", "content": ["Naps are a wonderful way to get bettersleep during pregnancy. Studies show more than half of pregnant women take a nap during the work week, and 60 percent take naps over the weekend."]}, {"subtitle": "Tattoos while pregnant", "content": ["Hold off until you've given birth to get inked, since there isn't enough research to establish whether getting atattoo while pregnantis safe for your developing baby."]}, {"subtitle": "Vitamin B12 during pregnancy", "content": ["Vitamin B12 is important for your baby's developing brain and spinal cord. Here are ways to have the recommended 2.6 micrograms ofvitamin B12 during pregnancyeach day."]}], [{"subtitle": "Opening their eyes", "content": ["Your baby'seyes can now open and close! Your baby may move in response to light: If you shine a flashlight at your tummy, you might feel a burst of flutters and wiggles."]}, {"subtitle": "Hiccups in the womb", "content": ["Any tiny, rhythmic movements you feel are likelyfetal hiccups. Each episode usually lasts only a few moments, and they're totally normal, so relax and enjoy the strange sensation."]}, {"subtitle": "Getting ready to breathe", "content": ["Your baby's lungs are making surfactant. This liquid substance helps the alveoli (tiny air sacs in the lungs) remain open, which makes it possible foryour baby to breatheafter birth."]}]]}}, "week 28": {"Title1": {"titles": ["Highlights this week", "Baby development at 28 weeks"], "sections": [[{"subtitle": "Hello, third trimester!", "content": ["You're in the home stretch. You'll most likely have acheckupevery two weeks until 36 weeks, then switch to once-a-week visits until you deliver."]}, {"subtitle": "Pregnancy weight gain", "content": ["In the third trimester, aim for a steadyweight gainof about a pound each week. You need about 450 extra calories per day to support your pregnancy – here are somehealthy pregnancy foodsandpregnancy snacksto help you meet that goal."]}, {"subtitle": "Sex: Yay or nay?", "content": ["Generally, it's safe to havesex during the third trimester. If you're having a healthy, uncomplicated pregnancy, you can probably continue to have sex right up until your water breaks or you go into labor."]}], [{"subtitle": "Your baby's brain", "content": ["Your baby'sbrainwill triple in weight this trimester. The cerebrum will develop deep, convoluted grooves that provide extra surface area without taking up more room in the skull."]}, {"subtitle": "Your baby's senses", "content": ["Your baby's senses of hearing,smell, andtouchare developed and functional."]}, {"subtitle": "Your baby's nervous system", "content": ["At 28 weeks, your baby's autonomic nervous system (which controls involuntary movements) is taking on new tasks. Specifically, it's starting to control your baby's body temperature and manage rhythmic breathing movements, which develop and strengthen your baby's lungs."]}, {"subtitle": "Having twins?", "content": ["Learn more about being28 weeks pregnant with twins."]}]]}}, "week 29": {"Title1": {"titles": ["Highlights this week", "Baby development at 29 weeks"], "sections": [[{"subtitle": "Feeling hiccups", "content": ["Noticing small, rhythmic movements? Your baby'shiccups in the wombare totally normal, and might play a role in lung maturation."]}, {"subtitle": "Third trimester to-dos", "content": ["Your baby will be here before you know it! As you get closer to your due date, check a few items off yourthird trimester to-do list."]}, {"subtitle": "Weight gain", "content": ["During the third trimester, you canexpect to gainan average of a pound each week. Don't obsess about the scale, but focus on staying active and eating a variety ofhealthy pregnancy foods."]}], [{"subtitle": "Building bone strength", "content": ["Your baby's bones are soaking up lots of calcium as they harden, so be sure to drink your milk (or find another good source ofcalcium, such as cheese, yogurt, or enriched orange juice). About 250 milligrams of calcium are deposited in your baby's skeleton each day."]}, {"subtitle": "Nerve protection", "content": ["A protective covering of myelin begins to form around your baby'snervesduring this trimester, a process that will continue after your baby's born."]}, {"subtitle": "Preparing to breathe", "content": ["Your baby's respiratory systemis still developing. Their lungs are producing surfactant, a liquid that helps keep the alveoli open. By 35 weeks, your baby will be making enough surfactant to allow them to breathe air at birth."]}]]}}, "week 30": {"Title1": {"titles": ["Highlights this week", "Baby development at 30 weeks"], "sections": [[{"subtitle": "Baby shower fun", "content": ["If you haven't had your shower yet, check out more than a dozen ideas forbaby shower gamesthat will keep your friends and family entertained."]}, {"subtitle": "Belly getting in the way?", "content": ["Missionary position may be harder to manage now. Luckily, there are lots of alternativepregnancy sex positions."]}, {"subtitle": "Eating the placenta", "content": ["If you want toeat your placentaafter birth, it's important to understand the benefits, risks, and how to safely preserve and prepare it."]}], [{"subtitle": "Your baby's skin", "content": ["Your baby'sskin cellsare making melanin, which gives skin its color. (The more melanin cells produce, the darker the skin.) But most melanin production doesn't happen until after birth. Your baby's permanent skin tone will be fully developed around 6 months old."]}, {"subtitle": "Your baby's hair", "content": ["Your little one may now have more hair on their head and less everywhere else.Lanugo– the fine hair that started growing on your baby's body a few months ago – will mostly fall out before they're born."]}, {"subtitle": "Your baby's eyes", "content": ["Your baby canopen their eyes wide, and may be able to see dim shapes. By 31 weeks, the pupils are able to constrict and expand, allowing the eyes to let in more or less light."]}]]}}, "week 31": {"Title1": {"titles": ["Highlights this week", "Baby development at 31 weeks"], "sections": [[{"subtitle": "Chores to avoid", "content": ["At 31 weeks, yournestingurge may be in full force, but it's important toavoid certain choresthat can be unsafe – like moving furniture and using strong chemicals."]}, {"subtitle": "Healthy pregnancy recipes", "content": ["Nourishing yourself and your baby is crucial during pregnancy, but it's not always easy. Thesepregnancy recipesare quick, delicious, and packed with nutrients."]}, {"subtitle": "Ready for parenting?", "content": ["BabyCenter Courses offers virtual classes oninfant CPROpens a new window,baby sleepOpens a new window, andphysical milestonesOpens a new windowwith expert info from members of our Medical Advisory Board."]}], [{"subtitle": "Fattening up", "content": ["Your baby's body is beginning to plump up as needed fat accumulates underneaththeir skin. For the rest of your pregnancy, your baby will be packing on the pounds in preparation for birth."]}, {"subtitle": "Your baby's movements", "content": ["Your baby can stretch, kick, and somersault – in fact, their dramatic motions may be keeping you up at night. Take comfort: All thisfetal movementis a sign that your baby is active and healthy."]}, {"subtitle": "Getting ready to breathe", "content": ["Your baby'slungsare developing rapidly, but they won't be ready to breathe air until about 36 weeks. (They need more time to produce surfactant, a substance that keeps the lungs inflated.) If your baby ispremature, they'll get some extra help breathing at birth. And if you're at risk forpreterm labor, you may be offeredsteroid shotsto speed up your baby's lung development."]}, {"subtitle": "Your baby's brain", "content": ["Brain developmentkicks into high gear in the last trimester as your baby's brain triples in weight. Also, the cerebrum develops deep grooves that provide extra surface area without taking up more room in the skull."]}]]}}, "week 32": {"Title1": {"titles": ["Highlights this week", "Baby development at 32 weeks"], "sections": [[{"subtitle": "Changing positions", "content": ["Most babies are head down by now, and in the next few weeks, your baby will likely get into anterior position – head down, facing your back. This is ideal for avaginal birth! About 97% of babies get here on their own – but some end up indifferent positions."]}, {"subtitle": "Able to survive and thrive", "content": ["At 32 weeks, if you have your baby early their chances of doing well are very good. Calledmoderately preterm, babies born between 32 and 34 weeks often need care in theNICU, but are unlikely to have lasting problems."]}, {"subtitle": "Baby movement", "content": ["Keep monitoring yourbaby's kicks, and tell your doctor or midwife immediately if you notice a change. Though your baby's quarters are getting cozy, they should still be as active as before."]}], [{"subtitle": "Storing minerals", "content": ["Your baby's body is stashing away important minerals such as iron, calcium, and phosphorus. Theiron storesyour baby builds now last for the first 6 months of life, until your little onestarts eating solid foods."]}, {"subtitle": "Your baby's lungs", "content": ["By next month,your baby's lungswill be fully formed. For now, your baby is practicing breathing by inhaling and exhaling amniotic fluid."]}, {"subtitle": "Your baby's genitalia", "content": ["If you're having a boy, hisexternal genitaliais formed and his testicles have started descending to the scrotum. If you're having a girl, her uterus and ovaries are in place with all the eggs she'll have."]}, {"subtitle": "Having twins?", "content": ["Learn more about being32 weeks pregnant with twins."]}]]}}, "week 33": {"Title1": {"titles": ["Highlights this week", "Baby development at 33 weeks"], "sections": [[{"subtitle": "More prenatal visits", "content": ["These days, you may feel like your doctor or midwife has a revolving door.Third-trimester prenatal visitsare frequent – and if you're having ahigh-riskpregnancy, you may see your provider even more often."]}, {"subtitle": "What happens after birth", "content": ["Find out what to expect in the minutes and hoursafter your baby arrives."]}, {"subtitle": "Is that pee?", "content": ["For most women, the amniotic sac doesn't rupture until right beforelabor starts, or during labor. But you may want to know what it feels like (and looks like)when your water breaks."]}], [{"subtitle": "Skull flexibility", "content": ["The bones inyour baby's skullaren't fused together, which allows them to move and slightly overlap. This makes it easier for your baby to fit through the birth canal (the channel formed by your cervix, vagina, and vulva). The pressure on their head during birth is so intense that many babies are born with apointy head! The skull bones don't entirely fuse until early adulthood, so they can grow asyour baby's brainand other tissue expands during infancy and childhood."]}, {"subtitle": "Your baby's skin", "content": ["Your little one is rapidly losing that wrinkled look. Theirbaby skinis less red and transparent – it's becoming soft and smooth as your little one plumps up in preparation for birth."]}, {"subtitle": "Baby movement", "content": ["It's getting snug in your womb, so your baby isn't doing as many somersaults, but the amount ofmovementyou feel should remain about the same. After your baby moves toa head-down positionin preparation for birth, you may feel kicks in new places, like underneath your ribs on one side or the other."]}]]}}, "week 34": {"Title1": {"titles": ["Highlights this week", "Baby development at 34 weeks"], "sections": [[{"subtitle": "Keeping tabs on your baby", "content": ["Your provider will measure yourfundal height– the distance from your pubic bone to the top of your uterus – at every visit to estimate your baby's size. (If you have ahigh-risk pregnancy, they'll useultrasoundinstead.)"]}, {"subtitle": "Tired of pregnancy?", "content": ["Carrying a growing baby isn't easy, especially as the end of your pregnancy approaches. If you're bored ortired of being pregnant, know that what you're feeling is completely normal."]}, {"subtitle": "Preparing for maternity leave", "content": ["If you're working, sort out the details ofyour maternity leave. Talk to your company's HR department, fill out paperwork, and write a transition plan."]}], [{"subtitle": "Growing nails", "content": ["At 34 weeks,your baby's fingernailshave grown to the end of their fingertips. Their toenails will reach the tip of their toes at38 weeks. (Get those infant nail clippers ready!)"]}, {"subtitle": "Chubby limbs", "content": ["Your baby is fattening up everywhere, and their arms and legs are starting to fill out beautifully."]}, {"subtitle": "Your baby's senses", "content": ["Your baby can respond tosounds,light, andtouch. By next week, your baby's ears will be fully formed."]}]]}}, "week 35": {"Title1": {"titles": ["Highlights this week", "Baby development at 35 weeks"], "sections": [[{"subtitle": "Ready to drop", "content": ["Soon your baby willdrop into your pelvis, giving your lungs more room but putting more pressure on your bladder. This is one way your body's preparing for labor – but it doesn't predict when labor will start."]}, {"subtitle": "Late-pregnancy dreams", "content": ["Hormonal changes plus sleep disturbances can lead to vivid andbizarre dreamsin late pregnancy. It's common for pregnant women to dream about their baby, body changes, water, and being in labor."]}, {"subtitle": "Caring for your newborn", "content": ["If you're feeling nervous about taking care of your new baby, check out thesenewborn tips from veteran parents."]}], [{"subtitle": "Amniotic fluid", "content": ["Your baby is cushioned and protected by about a quart ofamniotic fluid. It increases during pregnancy until about 36 weeks, then gradually decreases until you give birth."]}, {"subtitle": "Poop and pee", "content": ["Your baby's kidneys are fully developed now – they've actually been making urine since you were 13 weeks pregnant. (Your baby pees into the amniotic fluid!) Your baby'sfirst bowel movement(calledmeconium) is building up in their intestines."]}, {"subtitle": "Sleep patterns", "content": ["Your baby now has distinct sleeping patterns. You may start to recognize these cycles: You'll probablyfeel your baby movingmore when they're awake and less when they're asleep."]}]]}}, "week 36": {"Title1": {"titles": ["Highlights this week", "Baby development at 36 weeks"], "sections": [[{"subtitle": "Getting in position", "content": ["Most babies have gotten into position for birth by now, facing your spine with their head down. If yourbaby is breech(bottom-down), your provider may try to manually turn them by applying pressure to your abdomen."]}, {"subtitle": "Weekly prenatal visits", "content": ["Prenatal visitsare more frequent at the end of pregnancy – you'll see your provider once a week until delivery. They'll continue to check your blood pressure, weight, and urine and watch for complications."]}, {"subtitle": "If you give birth this week", "content": ["If your baby arrives at 36 weeks, they'll be considered \"late preterm\" and will have the same chance of being healthy asfull-terminfants."]}], [{"subtitle": "Your baby's lungs", "content": ["Your baby's lungs are ready for the outside world! When your newborn inhales for the first time – within about 10 seconds after delivery –their lungs expand, and any fluid remaining in the alveoli is replaced with air."]}, {"subtitle": "Baby bones are hardening", "content": ["Yourbaby's bonesare hardening, though they're still softer than an adult's. Some are made entirely of flexible cartilage that's gradually replaced by bone throughout childhood. Fun fact: Newborns are born with more than 275 bones, but adults have only 206. That's because some bones fuse together over time."]}, {"subtitle": "Making meconium", "content": ["Your baby's shedding most of their downy covering of hair (lanugo), as well as the waxy substance (vernix caseosa) that protected their skin in the womb. Your baby swallows both of these substances, along with other secretions, creating a blackish mixture calledmeconiumthat you'll see in their first fewpoops."]}, {"subtitle": "Having twins?", "content": ["Learn more about being36 weeks pregnant with twins."]}]]}}, "week 37": {"Title1": {"titles": ["Highlights this week", "Baby development at 37 weeks"], "sections": [[{"subtitle": "Labor approaching", "content": ["You could go into labor at any time – though most women give birth in the two weeks before and after their estimateddue date. You'll knowyou're in laborwhen your contractions are getting stronger, longer, and more frequent."]}, {"subtitle": "Cervix check", "content": ["Your doctor or midwife maycheck your cervixto see how much it has effaced (softened and thinned) and dilated (opened).Dilation and effacementmay not start until you go into labor, or it may gradually occur over several days or weeks toward the end of your pregnancy."]}, {"subtitle": "Almost to the finish line", "content": ["You're getting close now, but doctors don't consider your baby \"full term\" until39 weeks. Spending the next two weeks in the womb allowsyour baby's brain, lungs, and nervous system to fully mature."]}], [{"subtitle": "Your baby's hair", "content": ["Many babies have a full head of hair at birth, with locks from 1/2 inch to 1 1/2 inches long. Of course, some babies sport only peach fuzz. Don't be surprised ifyour baby's hairisn't the same color as yours. Also, it may fall out within the first six months and grow back a different color and texture!"]}, {"subtitle": "Your baby's eyes", "content": ["You may not see your baby's trueeye colorat birth. Some babies are born with their final eye color, but other newborns have dark blue or slate-gray eyes that gradually change to blue, green, hazel, or brown over the first year."]}, {"subtitle": "Gaining weight", "content": ["Your baby is continuing to put on weight, and the added fat is smoothing outtheir skin. A padding of fat will help keep them warm after birth."]}]]}}, "week 38": {"Title1": {"titles": ["Highlights this week", "Baby development at 38 weeks"], "sections": [[{"subtitle": "You're almost there!", "content": ["Most women give birth within two weeks of theirdue date. Watch for thesesigns that labor is near."]}, {"subtitle": "The nesting instinct", "content": ["Fueled by big bursts of energy, you may find yourself cleaning the nursery, setting up baby gear, and freezing lasagnas.Nestingis natural (and good!) – just don't overexert yourself."]}, {"subtitle": "Learn while you wait", "content": ["While you wait for your baby to arrive, consider taking virtual classes on lifesavinginfant CPROpens a new window,baby sleepOpens a new window, andphysical milestonesOpens a new windowfrom BabyCenter Courses."]}], [{"subtitle": "Baby nails", "content": ["Your baby'sfingernails and toenailsare fully formed – toenails have reached the tips of your baby's toes, and their fingernails may extend beyond their fingertips. Your baby may need a nail trim soon after birth, so get thosebaby nail clippersready!"]}, {"subtitle": "Looking good", "content": ["Your baby is ready for their first pictures: They have a nice layer of fat for smooth skin, they've shed most of theirlanugo(except perhaps some on their upper arms and shoulders), and they may have more hair on their head, too."]}]]}}, "week 39": {"Title1": {"titles": ["Highlights this week", "Baby development at 39 weeks"], "sections": [[{"subtitle": "Congratulations!", "content": ["Your baby isfull term. That means they're fully developed and ready to greet the world."]}, {"subtitle": "Staying active", "content": ["Gentle exerciseis okay now, as long as you don't have certain complications. Shoot for 20 minutes a day of walking, swimming, or stretching if you can."]}, {"subtitle": "Time to induce?", "content": ["If you're having a healthy pregnancy, your provider may suggestinducing laborat 39 weeks. Talk to your doctor or midwife if you're interested – but avoid so-callednatural ways to induce labor. These haven't been proven to work, and can cause unpleasant side effects."]}], [{"subtitle": "Still plumping up", "content": ["Your little one continues to build a layer of fat to help control their body temperature after birth. It's likely that your baby already measures about 20 inches andweighs just over 7 pounds. (Boys tend to be slightly heavier than girls.)"]}, {"subtitle": "Ready to interact with you", "content": ["Your baby has a firm grasp, which you'll soon be able to test when you hold their hand for the first time! Your baby also has coordinated reflexes, can turn their head, and will be able to see your face once they're born.Newborns can seeabout 6 to 10 inches away."]}]]}}, "week 40": {"Title1": {"titles": ["Highlights this week", "Baby development at 40 weeks"], "sections": [[{"subtitle": "You made it!", "content": ["Congratulations – you made it to your due date! Your pregnancy isfull termand your baby is fully developed and ready to meet you."]}, {"subtitle": "How to get labor going", "content": ["Natural ways to induce laboraren't proven to work – and some can be dangerous. But there are two methods that are worth a try: walking andhaving sex(if sex is still safe and comfortable for you). There's no solid proof that these will start your labor, but they could help, and you may enjoy them!"]}, {"subtitle": "Staying positive", "content": ["If you're anxious about going throughlaboror having aC-section, or frustrated with being hugely pregnant, practice a fewhelpful pregnancy affirmations. \"I trust my body to know what to do\" and \"I am capable of amazing things\" are good ones to start with."]}], [{"subtitle": "How big will your baby be?", "content": ["It's hard to say for sure, but theaverage baby weightfor newborns in the United States is between 7 and 8 pounds. The average length is about 20 inches."]}, {"subtitle": "Your baby's skin color", "content": ["Babies of all ethnicities are born with reddish-purple skin that changes to pinkish-red in a day or so. The pink tint comes from the red blood vessels that are visible throughyour baby's skin. Because your baby's blood circulation is still maturing, their hands and feet may be bluish for a few days. Babies of darker-skinned parents typically have lighter skin that gains pigment over time. Around 6 months old, your baby's skin will reach its permanent color."]}, {"subtitle": "Soft spots", "content": ["Your baby's skullisn't one large bone, like an adult's. It starts out as separate bones joined by flexible tissue. After your baby is born, you'll be able to feel the soft spots between the bones, called fontanels, on the top and back of your newborn's head."]}]]}}, "week 41": {"Title1": {"titles": ["Highlights this week", "Baby development at 41 weeks"], "sections": [[{"subtitle": "Time for induction?", "content": ["For safety reasons, your doctor or midwife will recommendinducing laborif your baby isn't born this week. Providers won't let you go more than two weekspast your due datebecause it raises the risk of complications.", "You'll also be seeing your provider more – perhaps twice a week until you deliver. They want to make sure that you and your baby stay healthy until your little one makes their grand entrance."]}, {"subtitle": "Meeting your baby", "content": ["At long last, you'll soon meet your precious little one. Yourbaby may looka little funny at first: Their head may be misshapen from squeezing through the birth canal, and their skin may be peeling from their long bath in amniotic fluid. That's okay: They'll still be absolutely beautiful to you."]}, {"subtitle": "Sharing the news", "content": ["How will youannounce your baby's birth? Most new parents use social media or a text, but some get more creative. Remember – there's no rush to announce. It's fine to take time to savor your new addition before telling the world they've arrived."]}], [{"subtitle": "Your overdue baby", "content": ["Your baby is \"late term\" – which means they've been camping out in your womb for a long time. They may be larger than the average baby. Also, they may have lost most of theirvernix, which is the waxy, white coating that stops their skin from drying out in the amniotic fluid."]}, {"subtitle": "How big is your baby now?", "content": ["At 41 weeks, yourbaby's sizeis impressive. According to estimates, they'll weigh 8.35 pounds and be 20.39 inches long. (Of course, this may be way off for your individual baby.)"]}]]}}}